------------------------------------------------------------------------------------------
       log:  C:\bdm2s2\data\May2002\output\Bdm2S2_ch7_inst_change.log
  log type:  text
 opened on:   9 Aug 2002, 00:19:17

.  reg lgdpWB W S ;

      Source |       SS       df       MS              Number of obs =    4868
-------------+------------------------------           F(  2,  4865) = 1489.66
       Model |  4360.59613     2  2180.29806           Prob > F      =  0.0000
    Residual |  7120.51246  4865  1.46362024           R-squared     =  0.3798
-------------+------------------------------           Adj R-squared =  0.3796
       Total |  11481.1086  4867  2.35897033           Root MSE      =  1.2098

------------------------------------------------------------------------------
      lgdpWB |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   3.691107   .0710694    51.94   0.000     3.551779    3.830435
           S |  -1.150328   .0653113   -17.61   0.000    -1.278368   -1.022288
       _cons |   6.200075   .0494369   125.41   0.000     6.103156    6.296993
------------------------------------------------------------------------------

.  predict WSincomeresWB, residual;
(14812 missing values generated)

. gen immigrep=immig~=.;

.  replace immigrep=. if year>1993;
(1321 real changes made, 1321 to missing)

.  gen emigrep=emig~=.;

.    replace emigrep=. if year>1993;
(1321 real changes made, 1321 to missing)

.  label var immigrep "Immigration data available (0/1)";

. label var emigrep "Emmigration data available (0/1)";

. gen emigcost=-1*(emigrep-1);
(1321 missing values generated)

. gen wemigcost=W*emigcost;
(1321 missing values generated)

. sort year;

. qui by year: gen simmig=sum(immig);

. qui by year: replace simmig=simmig[_N];

. qui by year: gen semig=sum(emig);

. qui by year: replace semig=semig[_N];

. egen mW=mean(W), by(year);
(163 missing values generated)

. gen emimrat=semig/simmig;
(1972 missing values generated)

. label var emimrat "ratio of worldwide emmigration/ worldwide immigration by year";

. gen clcost=CL/7;
(15600 missing values generated)

. gen clcostw=clcost*W;
(15600 missing values generated)

. gen clw=(8-CL-1)*W;
(15600 missing values generated)

. gen IMM=immig/WB_pop;
(19067 missing values generated)

.  label var IMM "immigration/population by country year";

. gen EMM=emig/WB_pop;
(19077 missing values generated)

.  label var EMM "emmigration/population by country year";

. regr demaut W;

      Source |       SS       df       MS              Number of obs =   13787
-------------+------------------------------           F(  1, 13785) =23645.15
       Model |  1080.49117     1  1080.49117           Prob > F      =  0.0000
    Residual |  629.920716 13785  .045696098           R-squared     =  0.6317
-------------+------------------------------           Adj R-squared =  0.6317
       Total |  1710.41189 13786  .124068757           Root MSE      =  .21377

------------------------------------------------------------------------------
      demaut |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   .8645353   .0056223   153.77   0.000     .8535149    .8755557
       _cons |   .0315135   .0031904     9.88   0.000     .0252599    .0377671
------------------------------------------------------------------------------

.  predict demres, residual;
(5893 missing values generated)

. tsset ccode year;
       panel variable:  ccode, 2 to 990
        time variable:  year, 1763 to 2000, but with gaps

. gen lagGrowthWB = L1.WB_growth;
(14393 missing values generated)

.  gen l3riot=L3.Riots;
(11690 missing values generated)

. gen l3strike=L3.GenStrikes;
(11690 missing values generated)

. gen l3demons=L3.AntiGovDem;
(11690 missing values generated)

. gen dcl30=CL-L3.CL;
(16102 missing values generated)

. gen l3civwar=L3.CL_WAR;
(18736 missing values generated)

. gen L3W=L3.W;
(726 missing values generated)

. gen F3S=F3.S-S;
(8204 missing values generated)

. gen F3W=F3.W-W;
(887 missing values generated)

. gen collapse=(F.change==-77);

.  replace collapse=. if F.change==.;
(17988 real changes made, 17988 to missing)

. label var collapse "Central state Authourity collapses next year";

. /* (!77) Authority Collapse: A "-77" code is recorded in the initial year of a collapse 
> of central state authority (i.e., state failure) and
>  "!77" for each subsequent year of collapse until a new polity is established or a trans
> ition 
> (!88) to a new polity or foreign interruption (!66) is initiated. (from POLITY4 codebook
> )*/
> 
> gen CL_war_end = (CL_WAR==0 & L.CL_WAR>0);

.  replace CL_war_end=. if CL_WAR==.;
(18735 real changes made, 18735 to missing)

. gen Revol_start=(Revolutions>0 & L1.Revolutions==0);

.  replace Revol_start=. if Revolutions==.|L.Revolutions==.;
(11545 real changes made, 11545 to missing)

. gen Revol_end=(Revolutions==0 & L1.Revolutions>0);

.   replace Revol_end=. if Revolutions==.|L.Revolutions==.;
(11545 real changes made, 11545 to missing)

. gen Guerilla_start = (Guerilla>0 &L1.Guerilla==0);

.  replace Guerilla_start =. if Guerilla==. |L1.Guerilla==.;
(11548 real changes made, 11548 to missing)

. gen Guerilla_end = (Guerilla==0 &L1.Guerilla>0);

.   replace Guerilla_end =. if Guerilla==. |L1.Guerilla==.;
(11548 real changes made, 11548 to missing)

. tsset, clear;

. regr lgdpWB W S;

      Source |       SS       df       MS              Number of obs =    4868
-------------+------------------------------           F(  2,  4865) = 1489.66
       Model |  4360.59613     2  2180.29806           Prob > F      =  0.0000
    Residual |  7120.51246  4865  1.46362024           R-squared     =  0.3798
-------------+------------------------------           Adj R-squared =  0.3796
       Total |  11481.1086  4867  2.35897033           Root MSE      =  1.2098

------------------------------------------------------------------------------
      lgdpWB |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   3.691107   .0710694    51.94   0.000     3.551779    3.830435
           S |  -1.150328   .0653113   -17.61   0.000    -1.278368   -1.022288
       _cons |   6.200075   .0494369   125.41   0.000     6.103156    6.296993
------------------------------------------------------------------------------

. predict incWB, residual;
(14812 missing values generated)

. gen coup=Coups>=1;

. replace coup=0 if Coups==0;
(0 real changes made)

. replace coup=. if Coups==.;
(6713 real changes made, 6713 to missing)

. des CL_WAR CL_war_start Guerilla ;

              storage  display     value
variable name   type   format      label      variable label
-------------------------------------------------------------------------------
CL_WAR          byte   %9.0g                  CIVIL War (1/0)
CL_war_start    byte   %9.0g                  COW: Does a civil war start
                                                this year? (1/0)
Guerilla        byte   %9.0g                  BANKS: Guerilla warfare-- aimed
                                                at overthrow of regime  

.   gen clwar=CL_WAR;
(18735 missing values generated)

. replace clwar=0 if CL_WAR==. & year>=1816 & year~=.;
(18174 real changes made)

. replace clwar=. if year<1816;
(0 real changes made)

. gen revolution=Revolutions>=1;

. replace revolution=. if year<1919;
(7365 real changes made, 7365 to missing)

. gen guerilla=Guerilla>=1;

. replace guerilla=. if year<1919;
(7365 real changes made, 7365 to missing)

. replace CL_war_start=0 if clwar==0;
(18174 real changes made)

. replace CL_war_start=. if year<1816;
(0 real changes made)

. replace Guerilla_start=0 if guerilla==0;
(228 real changes made)

. replace Guerilla_start=. if year<1919;
(0 real changes made)

. replace Revol_start=0 if Revolutions==0;
(208 real changes made)

. replace Revol_start=. if year<1919;
(0 real changes made)

. gen Revol_startW=Revol_start*W;
(11337 missing values generated)

. gen Revol_endW=Revol_end*W;
(11545 missing values generated)

. gen riot=Riots>=1;

.  replace riot=. if Riots==.;
(11280 real changes made, 11280 to missing)

. gen anti=AntiGovDem>=1;

.  replace anti=. if AntiGovDem==.;
(11280 real changes made, 11280 to missing)

. gen strike=GenStrikes>=1;

.  replace strike=. if GenStrikes==.;
(11280 real changes made, 11280 to missing)

. gen action=riots==1|anti==1|strike==1|Revol_start==1|CL_war_start==1|coup==1|guerilla==1
> ;

. gen bigaction=Revol_start==1|CL_war_start==1|guerilla==1|coup==1;

. gen actsum=riot==1;

. replace actsum=actsum+1 if anti==1;
(1521 real changes made)

. replace actsum=actsum+1 if strike==1;
(707 real changes made)

. replace actsum=actsum+1 if Revol_start==1;
(593 real changes made)

. replace actsum=actsum+1 if CL_war_start==1;
(253 real changes made)

. replace actsum=actsum+1 if coup==1;
(509 real changes made)

. replace actsum =actsum+1 if guerilla==1;
(5150 real changes made)

. gen actsumbig=Revol_start==1;

. replace actsumbig=actsumbig+1 if CL_war_start==1;
(253 real changes made)

. replace actsumbig=actsumbig+1 if coup==1;
(509 real changes made)

. replace actsumbig=actsumbig+1 if guerilla==1;
(5150 real changes made)

. /* reg lgdpWB W S ; predict WSincomeresWB, residual;*/
> gen W_WSincomeresWB=W*WSincomeresWB;
(14812 missing values generated)

. tsset ccode year;
       panel variable:  ccode, 2 to 990
        time variable:  year, 1763 to 2000, but with gaps

. replace F3W=F3.W;
(16255 real changes made)

. tsset, clear;

.  gen DF3W=F3W-W;
(887 missing values generated)

.  gen UPDOWN=1 if DF3W>=0 &DF3W~=.;
(2040 missing values generated)

. replace UPDOWN = 0 if DF3W<0 &DF3W~=.;
(1153 real changes made)

. gen f3w=DF3W ;
(887 missing values generated)

. replace f3w=-1 if DF3W<0;
(1136 real changes made)

.  replace f3w=1 if DF3W>0;
(2400 real changes made)

. replace f3w=. if DF3W==.;
(887 real changes made, 887 to missing)

. gen updown=dw30>=0;

. replace updown=. if dw30==.;
(886 real changes made, 886 to missing)

. replace updown=0 if dw30<0;
(0 real changes made)

. gen updown012=updown;
(886 missing values generated)

. replace updown012=2 if updown==1;
(17641 real changes made)

. replace updown012=1 if dw30==0;
(16103 real changes made)

. tsset ccode year;
       panel variable:  ccode, 2 to 990
        time variable:  year, 1763 to 2000, but with gaps

. gen l3act=L3.action;
(726 missing values generated)

. gen l3actw=L3.action*L3.W;
(726 missing values generated)

. gen l3actw2=l3actw^2;
(726 missing values generated)

. gen l3bigact=L3.bigaction;
(726 missing values generated)

. gen l3bigactw=L3.bigaction*L3.W;
(726 missing values generated)

. gen l3bigactw2=l3bigactw^2;
(726 missing values generated)

. gen l3bigactsum=L3.actsumbig;
(726 missing values generated)

.  gen l3actsum=L3.actsum;
(726 missing values generated)

.  gen l3actsumW=l3actsum*L3.W;
(726 missing values generated)

. gen l3bigactsumW=l3bigactsum*L3.W;
(726 missing values generated)

. gen l3actsum2=l3actsum^2;
(726 missing values generated)

. gen l3actsumW2=l3actsumW^2;
(726 missing values generated)

. gen l3bigactsum2=l3bigactsum^2;
(726 missing values generated)

. gen l3bigactsumW2=l3bigactsumW^2;
(726 missing values generated)

. gen l3coup=L3.coup;
(7135 missing values generated)

. gen l2coup=L2.coup;
(6941 missing values generated)

. gen l1coup=L1.coup;
(6746 missing values generated)

. gen f1coup=F1.coup;
(6751 missing values generated)

. gen f2coup=F2.coup;
(6797 missing values generated)

. gen fwos30=F3.WoverS-WoverS;
(8204 missing values generated)

. gen lwos30=WoverS-L3.WoverS;
(8204 missing values generated)

. replace nexcap=((Expenditure/100)*WB_gdp95)/WB_pop;
(3204 real changes made, 512 to missing)

. gen fnexcap30=F3.nexcap-nexcap;
(17497 missing values generated)

. gen fnexcap30p=fnexcap30/nexcap;
(17506 missing values generated)

. tsset, clear;

. logit immigrep W lpop_WB lgdpWB , or;

Iteration 0:   log likelihood = -1690.9187
Iteration 1:   log likelihood =  -1132.076
Iteration 2:   log likelihood = -971.69998
Iteration 3:   log likelihood = -953.36286
Iteration 4:   log likelihood = -952.42449
Iteration 5:   log likelihood =   -952.421

Logit estimates                                   Number of obs   =       4244
                                                  LR chi2(3)      =    1477.00
                                                  Prob > chi2     =     0.0000
Log likelihood =   -952.421                       Pseudo R2       =     0.4367

------------------------------------------------------------------------------
    immigrep | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   6.401776   1.768554     6.72   0.000     3.725184    11.00154
     lpop_WB |   1.912282   .0752373    16.48   0.000     1.770362    2.065579
      lgdpWB |   2.840152    .170563    17.38   0.000     2.524779    3.194918
------------------------------------------------------------------------------

. logit emigrep W lpop_WB lgdpWB , or;

Iteration 0:   log likelihood = -1681.6673
Iteration 1:   log likelihood = -1169.7127
Iteration 2:   log likelihood = -1026.1912
Iteration 3:   log likelihood = -1012.7486
Iteration 4:   log likelihood = -1012.2431
Iteration 5:   log likelihood =  -1012.242

Logit estimates                                   Number of obs   =       4244
                                                  LR chi2(3)      =    1338.85
                                                  Prob > chi2     =     0.0000
Log likelihood =  -1012.242                       Pseudo R2       =     0.3981

------------------------------------------------------------------------------
     emigrep | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   5.784967   1.506136     6.74   0.000     3.472864    9.636384
     lpop_WB |    1.49168   .0503469    11.85   0.000     1.396195    1.593695
      lgdpWB |   2.861567   .1669977    18.02   0.000     2.552283     3.20833
------------------------------------------------------------------------------

. xtreg immig W , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2423
Group variable (i) : regyr                      Number of groups   =       765

R-sq:  within  = 0.0001                         Obs per group: min =         1
       between = 0.2428                                        avg =       3.2
       overall = 0.0545                                        max =        14

                                                F(1,1657)          =      0.21
corr(u_i, Xb)  = -0.4266                        Prob > F           =    0.6498

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -8.273815   18.22098    -0.45   0.650    -44.01239    27.46476
       _cons |   89.72353   12.86609     6.97   0.000     64.48803     114.959
-------------+----------------------------------------------------------------
     sigma_u |  110.96243
     sigma_e |  176.02591
         rho |  .28437165   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(764, 1657) =     0.89           Prob > F = 0.9689

. xtreg immig W lpop_WB lgdpWB, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       579
Group variable (i) : regyr                      Number of groups   =       162

R-sq:  within  = 0.2288                         Obs per group: min =         1
       between = 0.5067                                        avg =       3.6
       overall = 0.3028                                        max =        10

                                                F(3,414)           =     40.94
corr(u_i, Xb)  = 0.0849                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   212.6954   86.12488     2.47   0.014     43.39884     381.992
     lpop_WB |   106.7775   9.717536    10.99   0.000     87.67561    125.8793
      lgdpWB |  -7.146631   20.69175    -0.35   0.730    -47.82061    33.52735
       _cons |  -1765.801   243.3503    -7.26   0.000    -2244.158   -1287.445
-------------+----------------------------------------------------------------
     sigma_u |  108.38243
     sigma_e |  225.21238
         rho |  .18804619   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(161, 414) =     0.43            Prob > F = 1.0000

. xtreg immig W demres lpop_WB lgdpWB, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       566
Group variable (i) : regyr                      Number of groups   =       162

R-sq:  within  = 0.3652                         Obs per group: min =         1
       between = 0.2944                                        avg =       3.5
       overall = 0.3022                                        max =        10

                                                F(4,400)           =     57.53
corr(u_i, Xb)  = -0.2802                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   496.4881   86.78287     5.72   0.000     325.8806    667.0956
      demres |  -1484.541   164.0425    -9.05   0.000    -1807.035   -1162.048
     lpop_WB |   124.1825   9.226751    13.46   0.000     106.0435    142.3214
      lgdpWB |   69.94222   22.15661     3.16   0.002     26.38426    113.5002
       _cons |  -2969.734   272.4278   -10.90   0.000    -3505.303   -2434.165
-------------+----------------------------------------------------------------
     sigma_u |   145.3318
     sigma_e |  207.86023
         rho |  .32834212   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(161, 400) =     0.66            Prob > F = 0.9987

. xtreg immig demaut lpop_WB lgdpWB, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       566
Group variable (i) : regyr                      Number of groups   =       162

R-sq:  within  = 0.2268                         Obs per group: min =         1
       between = 0.3723                                        avg =       3.5
       overall = 0.2610                                        max =        10

                                                F(3,401)           =     39.20
corr(u_i, Xb)  = -0.0176                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      demaut |  -98.59741    77.0379    -1.28   0.201     -250.046     52.8512
     lpop_WB |   106.7253   9.959414    10.72   0.000     87.14608    126.3044
      lgdpWB |   36.57874    24.1029     1.52   0.130    -10.80508    83.96256
       _cons |  -1899.625   272.4612    -6.97   0.000    -2435.255   -1363.994
-------------+----------------------------------------------------------------
     sigma_u |  123.13387
     sigma_e |   229.1172
         rho |  .22410143   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(161, 401) =     0.44            Prob > F = 1.0000

. xtreg immig lagGrowthWB  W lpop_WB lgdpWB,  fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       537
Group variable (i) : regyr                      Number of groups   =       152

R-sq:  within  = 0.2345                         Obs per group: min =         1
       between = 0.5294                                        avg =       3.5
       overall = 0.3145                                        max =        10

                                                F(4,381)           =     29.18
corr(u_i, Xb)  = 0.0832                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 lagGrowthWB |   .7401817    5.04604     0.15   0.883    -9.181392    10.66176
           W |   242.9075   92.30125     2.63   0.009     61.42386    424.3911
     lpop_WB |   106.6973   10.06279    10.60   0.000     86.91178    126.4829
      lgdpWB |  -5.935932   21.08233    -0.28   0.778    -47.38822    35.51636
       _cons |  -1805.203   254.7174    -7.09   0.000    -2306.031   -1304.376
-------------+----------------------------------------------------------------
     sigma_u |  107.98788
     sigma_e |   221.0295
         rho |  .19270101   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(151, 381) =     0.46            Prob > F = 1.0000

. xtreg immig lagGrowthWB  W lpop_WB ,  fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       537
Group variable (i) : regyr                      Number of groups   =       152

R-sq:  within  = 0.2344                         Obs per group: min =         1
       between = 0.5453                                        avg =       3.5
       overall = 0.3177                                        max =        10

                                                F(3,382)           =     38.98
corr(u_i, Xb)  = 0.0758                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 lagGrowthWB |   .8893833   5.012088     0.18   0.859     -8.96535    10.74412
           W |   236.9315   89.71953     2.64   0.009     60.52558    413.3375
     lpop_WB |   106.5052   10.02753    10.62   0.000     86.78918    126.2213
       _cons |  -1852.196   192.1871    -9.64   0.000    -2230.073   -1474.319
-------------+----------------------------------------------------------------
     sigma_u |  106.14463
     sigma_e |  220.76297
         rho |  .18776874   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(151, 382) =     0.47            Prob > F = 1.0000

. xtreg immig   exchprem W lpop_WB lgdpWB,  fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       124
Group variable (i) : regyr                      Number of groups   =        77

R-sq:  within  = 0.3902                         Obs per group: min =         1
       between = 0.0107                                        avg =       1.6
       overall = 0.0894                                        max =         4

                                                F(4,43)            =      6.88
corr(u_i, Xb)  = -0.6139                        Prob > F           =    0.0002

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exchprem |  -123.8442    47.7486    -2.59   0.013    -220.1384   -27.54995
           W |   222.8915   69.32887     3.21   0.002     83.07648    362.7065
     lpop_WB |   21.17769   6.237586     3.40   0.001       8.5984    33.75698
      lgdpWB |  -6.090927   13.94387    -0.44   0.664    -34.21142    22.02957
       _cons |   -382.623   125.4563    -3.05   0.004    -635.6298   -129.6162
-------------+----------------------------------------------------------------
     sigma_u |  59.708993
     sigma_e |  61.454712
         rho |  .48559505   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(76, 43) =     0.77              Prob > F = 0.8367

. xtreg immig lagGrow  exchprem W lpop_WB ,  fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       124
Group variable (i) : regyr                      Number of groups   =        77

R-sq:  within  = 0.4017                         Obs per group: min =         1
       between = 0.0066                                        avg =       1.6
       overall = 0.0687                                        max =         4

                                                F(4,43)            =      7.22
corr(u_i, Xb)  = -0.6862                        Prob > F           =    0.0002

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     lagGrow |  -256.8384   254.5675    -1.01   0.319    -770.2226    256.5458
    exchprem |  -127.6473   46.45562    -2.75   0.009     -221.334   -33.96064
           W |   218.9327   68.57275     3.19   0.003     80.64259    357.2228
     lpop_WB |   21.50197   5.678643     3.79   0.000     10.04989    32.95404
       _cons |  -428.3986   108.8034    -3.94   0.000    -647.8217   -208.9756
-------------+----------------------------------------------------------------
     sigma_u |  65.647687
     sigma_e |  60.874597
         rho |  .53767168   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(76, 43) =     0.78              Prob > F = 0.8338

. xtreg immig   Coups W lpop_WB lgdpWB,  fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       574
Group variable (i) : regyr                      Number of groups   =       162

R-sq:  within  = 0.2323                         Obs per group: min =         1
       between = 0.5276                                        avg =       3.5
       overall = 0.3108                                        max =        10

                                                F(4,408)           =     30.87
corr(u_i, Xb)  = 0.0716                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Coups |  -47.03578   136.6546    -0.34   0.731    -315.6708    221.5993
           W |   219.1459   87.55605     2.50   0.013     47.02858    391.2631
     lpop_WB |   108.2017   9.823174    11.01   0.000     88.89133     127.512
      lgdpWB |   1.006228   21.96013     0.05   0.963     -42.1629    44.17535
       _cons |  -1871.137   257.3665    -7.27   0.000    -2377.067   -1365.208
-------------+----------------------------------------------------------------
     sigma_u |  105.94513
     sigma_e |  226.33566
         rho |  .17972739   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(161, 408) =     0.42            Prob > F = 1.0000

. xtreg immig   W  s lpop_WB  , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       579
Group variable (i) : regyr                      Number of groups   =       162

R-sq:  within  = 0.2346                         Obs per group: min =         1
       between = 0.5108                                        avg =       3.6
       overall = 0.3076                                        max =        10

                                                F(3,414)           =     42.30
corr(u_i, Xb)  = 0.0828                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       immig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   199.2765   106.5813     1.87   0.062    -10.23142    408.7845
           s |   31.43469   94.33133     0.33   0.739    -153.9934    216.8628
     lpop_WB |   107.6308   9.630441    11.18   0.000     88.70018    126.5615
       _cons |   -1866.23   188.0439    -9.92   0.000    -2235.869    -1496.59
-------------+----------------------------------------------------------------
     sigma_u |  106.52453
     sigma_e |  224.74026
         rho |  .18345089   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(161, 414) =     0.45            Prob > F = 1.0000

. des  Assinations GenStrikes Purges GovCrises Riots Revolutions AntiGovDem ConflictIndex 
> Coups HeadofState Guerilla;

              storage  display     value
variable name   type   format      label      variable label
-------------------------------------------------------------------------------
Assinations     byte   %8.0g                  BANKS: Assinations--political
                                                motivated murder or attempt of
                                                high level official
GenStrikes      byte   %8.0g                  BANKS: Gneral strikes
                                                1000+workers, more than one
                                                employer  
Purges          byte   %8.0g                  Banks: systematic elimination
                                                (jail/kill) within regime or
                                                opposition  
GovCrises       byte   %8.0g                  BANKS: situation that threatens
                                                a downfall of regime (excl.
                                                revolt)  
Riots           byte   %8.0g                  Banks: violent demo./clash of
                                                100+ citizens involving
                                                physical force  
Revolutions     byte   %8.0g                  BANKS: illegal or forced chg.
                                                in top gov. elite, or attempt
                                                gain independence
AntiGovDem      byte   %8.0g                  BANKS: Peaceful public
                                                gathering 100+ people to
                                                express discontent  
ConflictIndex   long   %12.0g                 BANKS:
                                                24*assinations+43GenStrike+46Gu
                                                erilla+48GovCri+86Purges+102Rio
                                                ts+148Rev+2
Coups           byte   %8.0g                  BANKS: number of Coup d'Etat    
HeadofState     byte   %8.0g                  BANKS:
                                                1=monarch,2=president,3=militar
                                                y,4=other
Guerilla        byte   %9.0g                  BANKS: Guerilla warfare-- aimed
                                                at overthrow of regime  

.  des CL_WAR CL_war_start;

              storage  display     value
variable name   type   format      label      variable label
-------------------------------------------------------------------------------
CL_WAR          byte   %9.0g                  CIVIL War (1/0)
CL_war_start    byte   %9.0g                  COW: Does a civil war start
                                                this year? (1/0)

. xtreg AntiGovDem   W emigcost wemigcost     , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      7296
Group variable (i) : regyr                      Number of groups   =       439

R-sq:  within  = 0.0076                         Obs per group: min =         1
       between = 0.0004                                        avg =      16.6
       overall = 0.0045                                        max =        47

                                                F(3,6854)          =     17.54
corr(u_i, Xb)  = -0.0750                        Prob > F           =    0.0000

------------------------------------------------------------------------------
  AntiGovDem |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.056121   .1799497    -5.87   0.000    -1.408878   -.7033637
    emigcost |  -1.205843   .1681862    -7.17   0.000     -1.53554   -.8761456
   wemigcost |    1.23114   .1981342     6.21   0.000     .8427358    1.619545
       _cons |   1.524604   .1578561     9.66   0.000     1.215157     1.83405
-------------+----------------------------------------------------------------
     sigma_u |  .84232969
     sigma_e |  1.7052995
         rho |   .1961317   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(438, 6854) =     1.88           Prob > F = 0.0000

. test W+emigcost+wemigcost=0;

 ( 1)  W + emigcost + wemigcost = 0.0

       F(  1,  6854) =   39.02
            Prob > F =    0.0000


. test emigcost+wemigcost=0;

 ( 1)  emigcost + wemigcost = 0.0

       F(  1,  6854) =    0.11
            Prob > F =    0.7450


. xtreg GenStrikes   W emigcost wemigcost   , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      7296
Group variable (i) : regyr                      Number of groups   =       439

R-sq:  within  = 0.0085                         Obs per group: min =         1
       between = 0.0024                                        avg =      16.6
       overall = 0.0084                                        max =        47

                                                F(3,6854)          =     19.53
corr(u_i, Xb)  = -0.0385                        Prob > F           =    0.0000

------------------------------------------------------------------------------
  GenStrikes |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -.214778   .0560004    -3.84   0.000     -.324556   -.1049999
    emigcost |  -.3165829    .052342    -6.05   0.000    -.4191894   -.2139764
   wemigcost |   .2342429   .0616618     3.80   0.000     .1133666    .3551191
       _cons |   .4152092   .0491257     8.45   0.000     .3189076    .5115107
-------------+----------------------------------------------------------------
     sigma_u |  .17996775
     sigma_e |  .53069977
         rho |  .10313768   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(438, 6854) =     1.51           Prob > F = 0.0000

. test W+emigcost+wemigcost=0;

 ( 1)  W + emigcost + wemigcost = 0.0

       F(  1,  6854) =   33.47
            Prob > F =    0.0000


. test emigcost+wemigcost=0;

 ( 1)  emigcost + wemigcost = 0.0

       F(  1,  6854) =   11.57
            Prob > F =    0.0007


. xtreg Riots   W emigcost wemigcost    , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      7296
Group variable (i) : regyr                      Number of groups   =       439

R-sq:  within  = 0.0165                         Obs per group: min =         1
       between = 0.0074                                        avg =      16.6
       overall = 0.0165                                        max =        47

                                                F(3,6854)          =     38.44
corr(u_i, Xb)  = -0.0489                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       Riots |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.424748   .2056618    -6.93   0.000    -1.827909   -1.021588
    emigcost |  -1.912691   .1922263    -9.95   0.000    -2.289514   -1.535868
   wemigcost |   1.789523   .2264535     7.90   0.000     1.345604    2.233442
       _cons |   2.169291   .1804145    12.02   0.000     1.815622    2.522959
-------------+----------------------------------------------------------------
     sigma_u |  .79882942
     sigma_e |  1.9489994
         rho |  .14382864   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(438, 6854) =     1.49           Prob > F = 0.0000

. test W+emigcost+wemigcost=0;

 ( 1)  W + emigcost + wemigcost = 0.0

       F(  1,  6854) =   67.36
            Prob > F =    0.0000


. test emigcost+wemigcost=0;

 ( 1)  emigcost + wemigcost = 0.0

       F(  1,  6854) =    1.92
            Prob > F =    0.1660


. xtreg AntiGovDem   W clcost clcostw      , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      4001
Group variable (i) : regyr                      Number of groups   =       195

R-sq:  within  = 0.0232                         Obs per group: min =         1
       between = 0.0061                                        avg =      20.5
       overall = 0.0143                                        max =        44

                                                F(3,3803)          =     30.14
corr(u_i, Xb)  = -0.1551                        Prob > F           =    0.0000

------------------------------------------------------------------------------
  AntiGovDem |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.848284   .3132956    -9.09   0.000    -3.462528   -2.234041
      clcost |  -2.867735   .3369372    -8.51   0.000     -3.52833    -2.20714
     clcostw |   4.070699   .4372241     9.31   0.000     3.213483    4.927916
       _cons |   2.827346   .2705446    10.45   0.000     2.296919    3.357772
-------------+----------------------------------------------------------------
     sigma_u |  .52230818
     sigma_e |  1.7243153
         rho |  .08404191   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(194, 3803) =     1.50           Prob > F = 0.0000

. test W+clcost+clcostw=0;

 ( 1)  W + clcost + clcostw = 0.0

       F(  1,  3803) =   28.26
            Prob > F =    0.0000


. test clcost+clcostw=0;

 ( 1)  clcost + clcostw = 0.0

       F(  1,  3803) =   32.04
            Prob > F =    0.0000


. xtreg GenStrikes   W clcost clcostw  , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      4000
Group variable (i) : regyr                      Number of groups   =       195

R-sq:  within  = 0.0133                         Obs per group: min =         1
       between = 0.1888                                        avg =      20.5
       overall = 0.0248                                        max =        44

                                                F(3,3802)          =     17.05
corr(u_i, Xb)  = 0.1284                         Prob > F           =    0.0000

------------------------------------------------------------------------------
  GenStrikes |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -.566707   .0983454    -5.76   0.000    -.7595219   -.3738922
      clcost |  -.7306122   .1057719    -6.91   0.000    -.9379873    -.523237
     clcostw |   .7463019   .1372716     5.44   0.000     .4771688    1.015435
       _cons |   .7130339   .0849246     8.40   0.000     .5465317    .8795361
-------------+----------------------------------------------------------------
     sigma_u |  .19146843
     sigma_e |  .54123287
         rho |  .11122852   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(194, 3802) =     1.98           Prob > F = 0.0000

. test W+clcost+clcostw=0;

 ( 1)  W + clcost + clcostw = 0.0

       F(  1,  3802) =   32.18
            Prob > F =    0.0000


. test clcost+clcostw=0;

 ( 1)  clcost + clcostw = 0.0

       F(  1,  3802) =    0.06
            Prob > F =    0.8141


. xtreg Riots   W clcost clcostw  , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      4000
Group variable (i) : regyr                      Number of groups   =       195

R-sq:  within  = 0.0182                         Obs per group: min =         1
       between = 0.0141                                        avg =      20.5
       overall = 0.0158                                        max =        44

                                                F(3,3802)          =     23.45
corr(u_i, Xb)  = -0.0700                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       Riots |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.038833   .2864237    -7.12   0.000    -2.600391   -1.477274
      clcost |  -2.467957   .3080528    -8.01   0.000    -3.071922   -1.863993
     clcostw |   3.166591   .3997932     7.92   0.000     2.382762    3.950421
       _cons |   2.180726   .2473366     8.82   0.000       1.6958    2.665651
-------------+----------------------------------------------------------------
     sigma_u |  .34705013
     sigma_e |     1.5763
         rho |  .04623268   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(194, 3802) =     0.97           Prob > F = 0.5961

. test W+clcost+clcostw=0;

 ( 1)  W + clcost + clcostw = 0.0

       F(  1,  3802) =   22.44
            Prob > F =    0.0000


. test clcost+clcostw=0;

 ( 1)  clcost + clcostw = 0.0

       F(  1,  3802) =   12.93
            Prob > F =    0.0003


. xtreg dw30 l3demons l3riot l3strike , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      7832
Group variable (i) : regyr                      Number of groups   =       460

R-sq:  within  = 0.0028                         Obs per group: min =         1
       between = 0.0308                                        avg =      17.0
       overall = 0.0054                                        max =        47

                                                F(3,7369)          =      6.98
corr(u_i, Xb)  = 0.0582                         Prob > F           =    0.0001

------------------------------------------------------------------------------
        dw30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    l3demons |   .0039179   .0014322     2.74   0.006     .0011104    .0067254
      l3riot |  -.0002408   .0013058    -0.18   0.854    -.0028005    .0023188
    l3strike |   .0090651   .0038238     2.37   0.018     .0015693    .0165609
       _cons |  -.0098031    .001975    -4.96   0.000    -.0136746   -.0059316
-------------+----------------------------------------------------------------
     sigma_u |  .06765503
     sigma_e |  .16448144
         rho |  .14470464   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(459, 7369) =     2.57           Prob > F = 0.0000

. xtreg dcl30 l3demons l3riot l3strike , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      3506
Group variable (i) : regyr                      Number of groups   =       173

R-sq:  within  = 0.0068                         Obs per group: min =         1
       between = 0.0005                                        avg =      20.3
       overall = 0.0065                                        max =        44

                                                F(3,3330)          =      7.55
corr(u_i, Xb)  = 0.0047                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       dcl30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    l3demons |  -.0494598   .0109581    -4.51   0.000    -.0709451   -.0279746
      l3riot |   .0333931   .0116695     2.86   0.004      .010513    .0562733
    l3strike |   .0495654   .0269884     1.84   0.066    -.0033502     .102481
       _cons |  -.0538324   .0151148    -3.56   0.000    -.0834677   -.0241971
-------------+----------------------------------------------------------------
     sigma_u |  .41635475
     sigma_e |  .82487465
         rho |  .20304226   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(172, 3330) =     2.82           Prob > F = 0.0000

. capture program drop stuff;

. program define stuff;
  1.  xtlogit $depend dw30  , fe i(regyr);
  2. xtlogit $depend W , fe i(regyr);
  3. xtlogit $depend W s , fe i(regyr);
  4. xtlogit $depend WoverS  , fe i(regyr);
  5. xtlogit $depend W clcost clcostw, fe i(regyr);
  6. xtlogit $depend W emigcost wemigcost, fe i(regyr);
  7. xtlogit $depend W lpop_WB lgdpWB, fe i(regyr);
  8. xtlogit $depend W dw30 , fe i(regyr);
  9. xtlogit $depend dw30 , fe i(regyr);
 10.  end;

. global depend "revolution";

.  stuff;

note: multiple positive outcomes within groups encountered.
note: 92 groups (617 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5773.0668
Iteration 1:   log likelihood = -5751.8182
Iteration 2:   log likelihood = -5751.8001

Conditional fixed-effects logit                 Number of obs      =     11105
Group variable (i) : regyr                      Number of groups   =       475

                                                Obs per group: min =         3
                                                               avg =      23.4
                                                               max =        51

                                                LR chi2(1)         =     76.33
Log likelihood  = -5751.8001                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -1.208624   .1411252    -8.56   0.000    -1.485224   -.9320232
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 92 groups (649 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5808.6243
Iteration 1:   log likelihood = -5443.7459
Iteration 2:   log likelihood = -5440.3406
Iteration 3:   log likelihood =  -5440.339

Conditional fixed-effects logit                 Number of obs      =     11503
Group variable (i) : regyr                      Number of groups   =       475

                                                Obs per group: min =         4
                                                               avg =      24.2
                                                               max =        52

                                                LR chi2(1)         =   1164.04
Log likelihood  =  -5440.339                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -3.019954   .0953697   -31.67   0.000    -3.206875   -2.833033
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 121 groups (1021 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2980.4935
Iteration 1:   log likelihood = -2822.5758
Iteration 2:   log likelihood = -2822.1505
Iteration 3:   log likelihood = -2822.1505

Conditional fixed-effects logit                 Number of obs      =      7612
Group variable (i) : regyr                      Number of groups   =       361

                                                Obs per group: min =         2
                                                               avg =      21.1
                                                               max =        47

                                                LR chi2(2)         =    439.34
Log likelihood  = -2822.1505                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.531108   .1343224   -11.40   0.000    -1.794375    -1.26784
           s |  -.9002843    .093705    -9.61   0.000    -1.083943   -.7166259
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 121 groups (1021 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -3001.3632
Iteration 1:   log likelihood = -2890.8095
Iteration 2:   log likelihood = -2890.7092

Conditional fixed-effects logit                 Number of obs      =      7612
Group variable (i) : regyr                      Number of groups   =       361

                                                Obs per group: min =         2
                                                               avg =      21.1
                                                               max =        47

                                                LR chi2(1)         =    302.22
Log likelihood  = -2890.7092                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -1.977587   .1170818   -16.89   0.000    -2.207063   -1.748111
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 51 groups (374 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1547.6203
Iteration 1:   log likelihood = -1447.9811
Iteration 2:   log likelihood = -1445.6047
Iteration 3:   log likelihood = -1445.5923
Iteration 4:   log likelihood = -1445.5923

Conditional fixed-effects logit                 Number of obs      =      3706
Group variable (i) : regyr                      Number of groups   =       145

                                                Obs per group: min =         2
                                                               avg =      25.6
                                                               max =        44

                                                LR chi2(3)         =    263.18
Log likelihood  = -1445.5923                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -2.58056    .523799    -4.93   0.000    -3.607187   -1.553933
      clcost |   .8240905   .4802081     1.72   0.086    -.1171001    1.765281
     clcostw |   .6736531    .725097     0.93   0.353    -.7475108    2.094817
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 86 groups (619 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5315.1152
Iteration 1:   log likelihood = -4931.9691
Iteration 2:   log likelihood = -4917.8574
Iteration 3:   log likelihood = -4917.5146
Iteration 4:   log likelihood = -4917.5142

Conditional fixed-effects logit                 Number of obs      =     10375
Group variable (i) : regyr                      Number of groups   =       439

                                                Obs per group: min =         4
                                                               avg =      23.6
                                                               max =        52

                                                LR chi2(3)         =   1209.44
Log likelihood  = -4917.5142                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -3.408596   .2821137   -12.08   0.000    -3.961529   -2.855664
    emigcost |   .5979636   .2190352     2.73   0.006     .1686624    1.027265
   wemigcost |   .8282215   .3010922     2.75   0.006     .2380916    1.418351
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 38 groups (135 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2055.5934
Iteration 1:   log likelihood = -1889.4225
Iteration 2:   log likelihood = -1886.6357
Iteration 3:   log likelihood = -1886.6314

Conditional fixed-effects logit                 Number of obs      =      5110
Group variable (i) : regyr                      Number of groups   =       241

                                                Obs per group: min =         2
                                                               avg =      21.2
                                                               max =        45

                                                LR chi2(3)         =    433.29
Log likelihood  = -1886.6314                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -2.35079   .1615858   -14.55   0.000    -2.667492   -2.034088
     lpop_WB |  -.1480055   .0220766    -6.70   0.000    -.1912749   -.1047361
      lgdpWB |  -.3051432   .0400163    -7.63   0.000    -.3835736   -.2267127
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 92 groups (617 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5586.8943
Iteration 1:   log likelihood = -5230.2601
Iteration 2:   log likelihood = -5226.7052
Iteration 3:   log likelihood = -5226.7034

Conditional fixed-effects logit                 Number of obs      =     11105
Group variable (i) : regyr                      Number of groups   =       475

                                                Obs per group: min =         3
                                                               avg =      23.4
                                                               max =        51

                                                LR chi2(2)         =   1126.52
Log likelihood  = -5226.7034                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -3.095157   .1028176   -30.10   0.000    -3.296676   -2.893638
        dw30 |   .4079055   .1505136     2.71   0.007     .1129042    .7029068
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 92 groups (617 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5773.0668
Iteration 1:   log likelihood = -5751.8182
Iteration 2:   log likelihood = -5751.8001

Conditional fixed-effects logit                 Number of obs      =     11105
Group variable (i) : regyr                      Number of groups   =       475

                                                Obs per group: min =         3
                                                               avg =      23.4
                                                               max =        51

                                                LR chi2(1)         =     76.33
Log likelihood  = -5751.8001                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -1.208624   .1411252    -8.56   0.000    -1.485224   -.9320232
------------------------------------------------------------------------------

. global depend "guerilla";

.  stuff;

note: multiple positive outcomes within groups encountered.
note: 93 groups (622 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5522.8588
Iteration 1:   log likelihood = -5521.7821
Iteration 2:   log likelihood = -5521.7821

Conditional fixed-effects logit                 Number of obs      =     11100
Group variable (i) : regyr                      Number of groups   =       474

                                                Obs per group: min =         3
                                                               avg =      23.4
                                                               max =        51

                                                LR chi2(1)         =      8.38
Log likelihood  = -5521.7821                    Prob > chi2        =    0.0038

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.4092124   .1416764    -2.89   0.004     -.686893   -.1315319
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 93 groups (655 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5636.3172
Iteration 1:   log likelihood = -5448.0482
Iteration 2:   log likelihood = -5447.5548
Iteration 3:   log likelihood = -5447.5547

Conditional fixed-effects logit                 Number of obs      =     11497
Group variable (i) : regyr                      Number of groups   =       474

                                                Obs per group: min =         4
                                                               avg =      24.3
                                                               max =        52

                                                LR chi2(1)         =    612.17
Log likelihood  = -5447.5547                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.167427   .0910209   -23.81   0.000    -2.345825   -1.989029
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 125 groups (761 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2900.1396
Iteration 1:   log likelihood = -2881.9153
Iteration 2:   log likelihood = -2881.8987

Conditional fixed-effects logit                 Number of obs      =      7872
Group variable (i) : regyr                      Number of groups   =       357

                                                Obs per group: min =         2
                                                               avg =      22.1
                                                               max =        47

                                                LR chi2(2)         =     51.79
Log likelihood  = -2881.8987                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.5918417   .1288932    -4.59   0.000    -.8444676   -.3392157
           s |  -.2679868   .0993049    -2.70   0.007    -.4626208   -.0733527
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 125 groups (761 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2902.1216
Iteration 1:   log likelihood = -2889.3264
Iteration 2:   log likelihood = -2889.3263

Conditional fixed-effects logit                 Number of obs      =      7872
Group variable (i) : regyr                      Number of groups   =       357

                                                Obs per group: min =         2
                                                               avg =      22.1
                                                               max =        47

                                                LR chi2(1)         =     36.93
Log likelihood  = -2889.3263                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -.6861368   .1130256    -6.07   0.000    -.9076629   -.4646107
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 51 groups (243 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1442.8528
Iteration 1:   log likelihood = -1421.6298
Iteration 2:   log likelihood = -1421.5821
Iteration 3:   log likelihood = -1421.5821

Conditional fixed-effects logit                 Number of obs      =      3837
Group variable (i) : regyr                      Number of groups   =       145

                                                Obs per group: min =         2
                                                               avg =      26.5
                                                               max =        44

                                                LR chi2(3)         =     56.36
Log likelihood  = -1421.5821                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.1501714   .4978855    -0.30   0.763    -1.126009    .8256664
      clcost |   1.397246   .5060074     2.76   0.006     .4054898    2.389002
     clcostw |   -.298986   .6987108    -0.43   0.669    -1.668434    1.070462
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 87 groups (625 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5262.2864
Iteration 1:   log likelihood = -5062.8763
Iteration 2:   log likelihood = -5059.5311
Iteration 3:   log likelihood = -5059.5196
Iteration 4:   log likelihood = -5059.5196

Conditional fixed-effects logit                 Number of obs      =     10369
Group variable (i) : regyr                      Number of groups   =       438

                                                Obs per group: min =         4
                                                               avg =      23.7
                                                               max =        52

                                                LR chi2(3)         =    638.76
Log likelihood  = -5059.5196                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.964592    .250868   -11.82   0.000    -3.456284     -2.4729
    emigcost |  -.2215781   .2119684    -1.05   0.296    -.6370285    .1938723
   wemigcost |   1.313645   .2703284     4.86   0.000     .7838116    1.843479
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 39 groups (179 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1994.6823
Iteration 1:   log likelihood = -1958.7155
Iteration 2:   log likelihood = -1958.6556
Iteration 3:   log likelihood = -1958.6556

Conditional fixed-effects logit                 Number of obs      =      5066
Group variable (i) : regyr                      Number of groups   =       240

                                                Obs per group: min =         2
                                                               avg =      21.1
                                                               max =        45

                                                LR chi2(3)         =     93.56
Log likelihood  = -1958.6556                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -.802922    .156515    -5.13   0.000    -1.109686   -.4961582
     lpop_WB |   .0307455    .020716     1.48   0.138    -.0098571     .071348
      lgdpWB |   -.184434   .0372321    -4.95   0.000    -.2574075   -.1114605
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 93 groups (622 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5415.7143
Iteration 1:   log likelihood = -5225.8261
Iteration 2:   log likelihood = -5225.2016
Iteration 3:   log likelihood = -5225.2015

Conditional fixed-effects logit                 Number of obs      =     11100
Group variable (i) : regyr                      Number of groups   =       474

                                                Obs per group: min =         3
                                                               avg =      23.4
                                                               max =        51

                                                LR chi2(2)         =    601.54
Log likelihood  = -5225.2015                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.297596   .0983231   -23.37   0.000    -2.490306   -2.104886
        dw30 |   .8045708   .1500938     5.36   0.000     .5103924    1.098749
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 93 groups (622 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -5522.8588
Iteration 1:   log likelihood = -5521.7821
Iteration 2:   log likelihood = -5521.7821

Conditional fixed-effects logit                 Number of obs      =     11100
Group variable (i) : regyr                      Number of groups   =       474

                                                Obs per group: min =         3
                                                               avg =      23.4
                                                               max =        51

                                                LR chi2(1)         =      8.38
Log likelihood  = -5521.7821                    Prob > chi2        =    0.0038

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.4092124   .1416764    -2.89   0.004     -.686893   -.1315319
------------------------------------------------------------------------------

. global depend "clwar";

.  stuff;

note: multiple positive outcomes within groups encountered.
note: 827 groups (8323 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2429.8992
Iteration 1:   log likelihood = -2426.2257
Iteration 2:   log likelihood = -2426.2257

Conditional fixed-effects logit                 Number of obs      =     10018
Group variable (i) : regyr                      Number of groups   =       427

                                                Obs per group: min =         3
                                                               avg =      23.5
                                                               max =        51

                                                LR chi2(1)         =      7.71
Log likelihood  = -2426.2257                    Prob > chi2        =    0.0055

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.6478383   .2330974    -2.78   0.005    -1.104701   -.1909758
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 830 groups (8709 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2448.8822
Iteration 1:   log likelihood = -2412.5881
Iteration 2:   log likelihood = -2412.5759

Conditional fixed-effects logit                 Number of obs      =     10249
Group variable (i) : regyr                      Number of groups   =       427

                                                Obs per group: min =         3
                                                               avg =      24.0
                                                               max =        52

                                                LR chi2(1)         =     79.38
Log likelihood  = -2412.5759                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.241368    .140993    -8.80   0.000     -1.51771   -.9650271
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 675 groups (5040 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2035.4365
Iteration 1:   log likelihood = -1984.7883
Iteration 2:   log likelihood = -1984.7203
Iteration 3:   log likelihood = -1984.7203

Conditional fixed-effects logit                 Number of obs      =      7401
Group variable (i) : regyr                      Number of groups   =       407

                                                Obs per group: min =         2
                                                               avg =      18.2
                                                               max =        47

                                                LR chi2(2)         =    117.82
Log likelihood  = -1984.7203                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.595951    .160633    -9.94   0.000    -1.910786   -1.281116
           s |   .0425329   .1099959     0.39   0.699    -.1730551    .2581209
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 675 groups (5040 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2035.3335
Iteration 1:   log likelihood = -1985.6467
Iteration 2:   log likelihood = -1985.6199

Conditional fixed-effects logit                 Number of obs      =      7401
Group variable (i) : regyr                      Number of groups   =       407

                                                Obs per group: min =         2
                                                               avg =      18.2
                                                               max =        47

                                                LR chi2(1)         =    116.02
Log likelihood  = -1985.6199                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -1.528159    .144587   -10.57   0.000    -1.811545   -1.244774
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 68 groups (929 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1039.0211
Iteration 1:   log likelihood = -959.21642
Iteration 2:   log likelihood = -958.13675
Iteration 3:   log likelihood =  -958.1308
Iteration 4:   log likelihood =  -958.1308

Conditional fixed-effects logit                 Number of obs      =      3151
Group variable (i) : regyr                      Number of groups   =       128

                                                Obs per group: min =         7
                                                               avg =      24.6
                                                               max =        44

                                                LR chi2(3)         =    193.22
Log likelihood  =  -958.1308                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   .9355187   .7437569     1.26   0.208     -.522218    2.393255
      clcost |   4.329346   .6829477     6.34   0.000     2.990793    5.667899
     clcostw |  -.8283171   .9827116    -0.84   0.399    -2.754396    1.097762
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 803 groups (8127 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2321.6097
Iteration 1:   log likelihood = -2274.5986
Iteration 2:   log likelihood = -2271.9756
Iteration 3:   log likelihood = -2271.9732

Conditional fixed-effects logit                 Number of obs      =      9673
Group variable (i) : regyr                      Number of groups   =       412

                                                Obs per group: min =         3
                                                               avg =      23.5
                                                               max =        52

                                                LR chi2(3)         =    104.21
Log likelihood  = -2271.9732                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.725346   .3266436    -5.28   0.000    -2.365555   -1.085136
    emigcost |   -1.15055   .2381027    -4.83   0.000    -1.617223   -.6838773
   wemigcost |   .4994115   .3552852     1.41   0.160    -.1969346    1.195758
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 120 groups (1504 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -919.26763
Iteration 1:   log likelihood = -817.37166
Iteration 2:   log likelihood = -813.84986
Iteration 3:   log likelihood = -813.83194
Iteration 4:   log likelihood = -813.83194

Conditional fixed-effects logit                 Number of obs      =      3741
Group variable (i) : regyr                      Number of groups   =       159

                                                Obs per group: min =         7
                                                               avg =      23.5
                                                               max =        45

                                                LR chi2(3)         =    235.43
Log likelihood  = -813.83194                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   .2180259   .2541357     0.86   0.391    -.2800709    .7161227
     lpop_WB |   .4858818   .0396581    12.25   0.000     .4081534    .5636103
      lgdpWB |  -.3248566    .064992    -5.00   0.000    -.4522386   -.1974746
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 827 groups (8323 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2426.6618
Iteration 1:   log likelihood = -2390.2639
Iteration 2:   log likelihood = -2390.2317
Iteration 3:   log likelihood = -2390.2317

Conditional fixed-effects logit                 Number of obs      =     10018
Group variable (i) : regyr                      Number of groups   =       427

                                                Obs per group: min =         3
                                                               avg =      23.5
                                                               max =        51

                                                LR chi2(2)         =     79.69
Log likelihood  = -2390.2317                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.245508   .1490331    -8.36   0.000    -1.537607   -.9534083
        dw30 |   .0197039   .2409063     0.08   0.935    -.4524639    .4918717
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 827 groups (8323 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2429.8992
Iteration 1:   log likelihood = -2426.2257
Iteration 2:   log likelihood = -2426.2257

Conditional fixed-effects logit                 Number of obs      =     10018
Group variable (i) : regyr                      Number of groups   =       427

                                                Obs per group: min =         3
                                                               avg =      23.5
                                                               max =        51

                                                LR chi2(1)         =      7.71
Log likelihood  = -2426.2257                    Prob > chi2        =    0.0055

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.6478383   .2330974    -2.78   0.005    -1.104701   -.1909758
------------------------------------------------------------------------------

. global depend "Revol_start";

.  stuff;

note: multiple positive outcomes within groups encountered.
note: 207 groups (2258 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1487.1198
Iteration 1:   log likelihood = -1461.0372
Iteration 2:   log likelihood =  -1461.012

Conditional fixed-effects logit                 Number of obs      =      6066
Group variable (i) : regyr                      Number of groups   =       274

                                                Obs per group: min =         2
                                                               avg =      22.1
                                                               max =        47

                                                LR chi2(1)         =     60.98
Log likelihood  =  -1461.012                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 Revol_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -1.849837   .2338453    -7.91   0.000    -2.308165   -1.391508
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 206 groups (2265 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1485.4048
Iteration 1:   log likelihood = -1427.6991
Iteration 2:   log likelihood = -1427.6803

Conditional fixed-effects logit                 Number of obs      =      6078
Group variable (i) : regyr                      Number of groups   =       275

                                                Obs per group: min =         3
                                                               avg =      22.1
                                                               max =        47

                                                LR chi2(1)         =    134.37
Log likelihood  = -1427.6803                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 Revol_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -1.93089   .1706582   -11.31   0.000    -2.265374   -1.596406
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 206 groups (2255 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1479.9643
Iteration 1:   log likelihood = -1414.9199
Iteration 2:   log likelihood =  -1414.177
Iteration 3:   log likelihood =  -1414.177

Conditional fixed-effects logit                 Number of obs      =      6068
Group variable (i) : regyr                      Number of groups   =       275

                                                Obs per group: min =         3
                                                               avg =      22.1
                                                               max =        47

                                                LR chi2(2)         =    156.11
Log likelihood  =  -1414.177                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 Revol_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.461315   .1965218    -7.44   0.000     -1.84649   -1.076139
           s |  -.6027826   .1274439    -4.73   0.000     -.852568   -.3529972
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 206 groups (2255 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1483.3595
Iteration 1:   log likelihood = -1430.6672
Iteration 2:   log likelihood = -1430.6603

Conditional fixed-effects logit                 Number of obs      =      6068
Group variable (i) : regyr                      Number of groups   =       275

                                                Obs per group: min =         3
                                                               avg =      22.1
                                                               max =        47

                                                LR chi2(1)         =    123.14
Log likelihood  = -1430.6603                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 Revol_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -1.829792   .1682211   -10.88   0.000    -2.159499   -1.500084
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 78 groups (944 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -731.54324
Iteration 1:   log likelihood = -704.16485
Iteration 2:   log likelihood = -703.83826
Iteration 3:   log likelihood = -703.83804

Conditional fixed-effects logit                 Number of obs      =      3046
Group variable (i) : regyr                      Number of groups   =       116

                                                Obs per group: min =         7
                                                               avg =      26.3
                                                               max =        44

                                                LR chi2(3)         =     63.82
Log likelihood  = -703.83804                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 Revol_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.969886   .7295761    -4.07   0.000    -4.399829   -1.539943
      clcost |  -.9748325   .6851838    -1.42   0.155    -2.317768    .3681031
     clcostw |   1.520601   1.041281     1.46   0.144    -.5202722    3.561474
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 186 groups (1921 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1332.9326
Iteration 1:   log likelihood = -1276.1104
Iteration 2:   log likelihood = -1275.8726
Iteration 3:   log likelihood = -1275.8722

Conditional fixed-effects logit                 Number of obs      =      5318
Group variable (i) : regyr                      Number of groups   =       253

                                                Obs per group: min =         3
                                                               avg =      21.0
                                                               max =        47

                                                LR chi2(3)         =    132.56
Log likelihood  = -1275.8722                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 Revol_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.706586   .4725648    -3.61   0.000    -2.632796   -.7803766
    emigcost |   .5261981   .3645592     1.44   0.149    -.1883248    1.240721
   wemigcost |   -.252228   .5111728    -0.49   0.622    -1.254108    .7496522
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 119 groups (1526 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -795.15104
Iteration 1:   log likelihood = -746.48249
Iteration 2:   log likelihood = -746.09009
Iteration 3:   log likelihood = -746.08984

Conditional fixed-effects logit                 Number of obs      =      3257
Group variable (i) : regyr                      Number of groups   =       146

                                                Obs per group: min =         3
                                                               avg =      22.3
                                                               max =        45

                                                LR chi2(3)         =    111.25
Log likelihood  = -746.08984                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 Revol_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -1.86821   .2500829    -7.47   0.000    -2.358364   -1.378057
     lpop_WB |   .0751184   .0397144     1.89   0.059    -.0027204    .1529572
      lgdpWB |  -.2176213   .0719658    -3.02   0.002    -.3586717   -.0765708
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 207 groups (2258 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood =  -1480.482
Iteration 1:   log likelihood = -1417.6109
Iteration 2:   log likelihood = -1417.4256

Conditional fixed-effects logit                 Number of obs      =      6066
Group variable (i) : regyr                      Number of groups   =       274

                                                Obs per group: min =         2
                                                               avg =      22.1
                                                               max =        47

                                                LR chi2(2)         =    148.16
Log likelihood  = -1417.4256                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 Revol_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.688102   .1841812    -9.17   0.000    -2.049091   -1.327114
        dw30 |  -.8876726   .2481407    -3.58   0.000    -1.374019   -.4013257
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 207 groups (2258 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1487.1198
Iteration 1:   log likelihood = -1461.0372
Iteration 2:   log likelihood =  -1461.012

Conditional fixed-effects logit                 Number of obs      =      6066
Group variable (i) : regyr                      Number of groups   =       274

                                                Obs per group: min =         2
                                                               avg =      22.1
                                                               max =        47

                                                LR chi2(1)         =     60.98
Log likelihood  =  -1461.012                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 Revol_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -1.849837   .2338453    -7.91   0.000    -2.308165   -1.391508
------------------------------------------------------------------------------

.  global depend "Revol_end";

.    stuff;

note: multiple positive outcomes within groups encountered.
note: 193 groups (2143 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1528.2081
Iteration 1:   log likelihood = -1525.0971
Iteration 2:   log likelihood = -1525.0969

Conditional fixed-effects logit                 Number of obs      =      5982
Group variable (i) : regyr                      Number of groups   =       274

                                                Obs per group: min =         2
                                                               avg =      21.8
                                                               max =        47

                                                LR chi2(1)         =      7.14
Log likelihood  = -1525.0969                    Prob > chi2        =    0.0076

------------------------------------------------------------------------------
   Revol_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.6360154    .237131    -2.68   0.007    -1.100784   -.1712472
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 193 groups (2146 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1523.8099
Iteration 1:   log likelihood = -1487.4605
Iteration 2:   log likelihood = -1487.4584

Conditional fixed-effects logit                 Number of obs      =      5989
Group variable (i) : regyr                      Number of groups   =       274

                                                Obs per group: min =         2
                                                               avg =      21.9
                                                               max =        47

                                                LR chi2(1)         =     85.59
Log likelihood  = -1487.4584                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   Revol_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.508233   .1652393    -9.13   0.000    -1.832096    -1.18437
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 193 groups (2138 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1522.2694
Iteration 1:   log likelihood = -1482.5154
Iteration 2:   log likelihood =  -1482.261
Iteration 3:   log likelihood =  -1482.261

Conditional fixed-effects logit                 Number of obs      =      5979
Group variable (i) : regyr                      Number of groups   =       274

                                                Obs per group: min =         2
                                                               avg =      21.8
                                                               max =        47

                                                LR chi2(2)         =     94.98
Log likelihood  =  -1482.261                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   Revol_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -1.23162   .1882838    -6.54   0.000     -1.60065   -.8625907
           s |  -.3897336   .1273824    -3.06   0.002    -.6393986   -.1400687
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 193 groups (2138 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood =  -1523.644
Iteration 1:   log likelihood = -1490.0371
Iteration 2:   log likelihood = -1490.0364

Conditional fixed-effects logit                 Number of obs      =      5979
Group variable (i) : regyr                      Number of groups   =       274

                                                Obs per group: min =         2
                                                               avg =      21.8
                                                               max =        47

                                                LR chi2(1)         =     79.43
Log likelihood  = -1490.0364                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   Revol_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |    -1.4402   .1634345    -8.81   0.000    -1.760526   -1.119874
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 83 groups (1048 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -718.27022
Iteration 1:   log likelihood = -701.76712
Iteration 2:   log likelihood = -701.62932
Iteration 3:   log likelihood = -701.62931

Conditional fixed-effects logit                 Number of obs      =      2917
Group variable (i) : regyr                      Number of groups   =       111

                                                Obs per group: min =         2
                                                               avg =      26.3
                                                               max =        44

                                                LR chi2(3)         =     38.50
Log likelihood  = -701.62931                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   Revol_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.928416   .7347667    -3.99   0.000    -4.368532   -1.488299
      clcost |  -1.561942   .7089545    -2.20   0.028    -2.951468    -.172417
     clcostw |   2.042105    1.04959     1.95   0.052    -.0150543    4.099264
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 175 groups (1866 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood =   -1342.98
Iteration 1:   log likelihood = -1305.2397
Iteration 2:   log likelihood = -1305.0467
Iteration 3:   log likelihood = -1305.0465

Conditional fixed-effects logit                 Number of obs      =      5166
Group variable (i) : regyr                      Number of groups   =       250

                                                Obs per group: min =         2
                                                               avg =      20.7
                                                               max =        46

                                                LR chi2(3)         =     88.45
Log likelihood  = -1305.0465                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   Revol_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.778079   .4417992    -4.02   0.000     -2.64399   -.9121688
    emigcost |   .1175415   .3446756     0.34   0.733    -.5580102    .7930932
   wemigcost |   .2920327    .480614     0.61   0.543    -.6499533    1.234019
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 115 groups (1429 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -803.84352
Iteration 1:   log likelihood = -765.25164
Iteration 2:   log likelihood = -764.86517
Iteration 3:   log likelihood = -764.86493

Conditional fixed-effects logit                 Number of obs      =      3287
Group variable (i) : regyr                      Number of groups   =       150

                                                Obs per group: min =         3
                                                               avg =      21.9
                                                               max =        45

                                                LR chi2(3)         =     88.09
Log likelihood  = -764.86493                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   Revol_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -1.40334   .2493716    -5.63   0.000    -1.892099   -.9145805
     lpop_WB |   .0762894   .0391394     1.95   0.051    -.0004225    .1530013
      lgdpWB |  -.2724507   .0711903    -3.83   0.000     -.411981   -.1329203
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 193 groups (2143 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1522.3115
Iteration 1:   log likelihood = -1486.2049
Iteration 2:   log likelihood = -1486.1818

Conditional fixed-effects logit                 Number of obs      =      5982
Group variable (i) : regyr                      Number of groups   =       274

                                                Obs per group: min =         2
                                                               avg =      21.8
                                                               max =        47

                                                LR chi2(2)         =     84.97
Log likelihood  = -1486.1818                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   Revol_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.549171   .1784439    -8.68   0.000    -1.898915   -1.199428
        dw30 |   .1850629   .2471459     0.75   0.454    -.2993341      .66946
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 193 groups (2143 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1528.2081
Iteration 1:   log likelihood = -1525.0971
Iteration 2:   log likelihood = -1525.0969

Conditional fixed-effects logit                 Number of obs      =      5982
Group variable (i) : regyr                      Number of groups   =       274

                                                Obs per group: min =         2
                                                               avg =      21.8
                                                               max =        47

                                                LR chi2(1)         =      7.14
Log likelihood  = -1525.0969                    Prob > chi2        =    0.0076

------------------------------------------------------------------------------
   Revol_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.6360154    .237131    -2.68   0.007    -1.100784   -.1712472
------------------------------------------------------------------------------

.  global depend "Guerilla_start";

.  stuff;

note: multiple positive outcomes within groups encountered.
note: 233 groups (2642 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1256.7306
Iteration 1:   log likelihood = -1256.0938
Iteration 2:   log likelihood = -1256.0938

Conditional fixed-effects logit                 Number of obs      =      5700
Group variable (i) : regyr                      Number of groups   =       248

                                                Obs per group: min =         2
                                                               avg =      23.0
                                                               max =        47

                                                LR chi2(1)         =      1.57
Log likelihood  = -1256.0938                    Prob > chi2        =    0.2109

------------------------------------------------------------------------------
Guerilla_s~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.3474541    .277306    -1.25   0.210     -.890964    .1960557
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 233 groups (2655 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1258.0961
Iteration 1:   log likelihood = -1252.2499
Iteration 2:   log likelihood = -1252.2496

Conditional fixed-effects logit                 Number of obs      =      5705
Group variable (i) : regyr                      Number of groups   =       248

                                                Obs per group: min =         2
                                                               avg =      23.0
                                                               max =        47

                                                LR chi2(1)         =     13.36
Log likelihood  = -1252.2496                    Prob > chi2        =    0.0003

------------------------------------------------------------------------------
Guerilla_s~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.6415223   .1754504    -3.66   0.000    -.9853987   -.2976459
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 233 groups (2647 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1256.0317
Iteration 1:   log likelihood = -1250.1929
Iteration 2:   log likelihood =   -1250.19
Iteration 3:   log likelihood =   -1250.19

Conditional fixed-effects logit                 Number of obs      =      5694
Group variable (i) : regyr                      Number of groups   =       248

                                                Obs per group: min =         2
                                                               avg =      23.0
                                                               max =        47

                                                LR chi2(2)         =     13.34
Log likelihood  =   -1250.19                    Prob > chi2        =    0.0013

------------------------------------------------------------------------------
Guerilla_s~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.6064216   .1971979    -3.08   0.002    -.9929224   -.2199207
           s |  -.0540269   .1532276    -0.35   0.724    -.3543475    .2462938
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 233 groups (2647 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1256.0909
Iteration 1:   log likelihood =  -1250.665
Iteration 2:   log likelihood = -1250.6647

Conditional fixed-effects logit                 Number of obs      =      5694
Group variable (i) : regyr                      Number of groups   =       248

                                                Obs per group: min =         2
                                                               avg =      23.0
                                                               max =        47

                                                LR chi2(1)         =     12.39
Log likelihood  = -1250.6647                    Prob > chi2        =    0.0004

------------------------------------------------------------------------------
Guerilla_s~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -.6143853   .1744262    -3.52   0.000    -.9562544   -.2725161
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 94 groups (1277 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -498.62422
Iteration 1:   log likelihood = -496.84028
Iteration 2:   log likelihood = -496.83699

Conditional fixed-effects logit                 Number of obs      =      2717
Group variable (i) : regyr                      Number of groups   =       100

                                                Obs per group: min =         7
                                                               avg =      27.2
                                                               max =        44

                                                LR chi2(3)         =      3.75
Log likelihood  = -496.83699                    Prob > chi2        =    0.2892

------------------------------------------------------------------------------
Guerilla_s~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   1.298989   .8921941     1.46   0.145    -.4496794    3.047657
      clcost |   1.646891   .9309141     1.77   0.077    -.1776672    3.471449
     clcostw |  -1.465963   1.225598    -1.20   0.232     -3.86809    .9361637
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 210 groups (2250 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1167.0755
Iteration 1:   log likelihood = -1160.0444
Iteration 2:   log likelihood = -1159.8304
Iteration 3:   log likelihood = -1159.8303

Conditional fixed-effects logit                 Number of obs      =      5009
Group variable (i) : regyr                      Number of groups   =       229

                                                Obs per group: min =         2
                                                               avg =      21.9
                                                               max =        47

                                                LR chi2(3)         =     17.18
Log likelihood  = -1159.8303                    Prob > chi2        =    0.0006

------------------------------------------------------------------------------
Guerilla_s~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -1.36421   .3635518    -3.75   0.000    -2.076758   -.6516611
    emigcost |  -.8966628   .3251936    -2.76   0.006     -1.53403   -.2592951
   wemigcost |   .9790258   .4173068     2.35   0.019     .1611195    1.796932
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 122 groups (1700 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -632.72993
Iteration 1:   log likelihood = -607.98067
Iteration 2:   log likelihood = -607.86015
Iteration 3:   log likelihood = -607.86014

Conditional fixed-effects logit                 Number of obs      =      3081
Group variable (i) : regyr                      Number of groups   =       143

                                                Obs per group: min =         3
                                                               avg =      21.5
                                                               max =        45

                                                LR chi2(3)         =     55.34
Log likelihood  = -607.86014                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
Guerilla_s~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.0839277   .2883576    -0.29   0.771    -.6490981    .4812428
     lpop_WB |   .2897176   .0442959     6.54   0.000     .2028992     .376536
      lgdpWB |  -.1114009   .0706411    -1.58   0.115     -.249855    .0270532
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 233 groups (2642 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1256.0355
Iteration 1:   log likelihood = -1250.2292
Iteration 2:   log likelihood =  -1250.228
Iteration 3:   log likelihood =  -1250.228

Conditional fixed-effects logit                 Number of obs      =      5700
Group variable (i) : regyr                      Number of groups   =       248

                                                Obs per group: min =         2
                                                               avg =      23.0
                                                               max =        47

                                                LR chi2(2)         =     13.30
Log likelihood  =  -1250.228                    Prob > chi2        =    0.0013

------------------------------------------------------------------------------
Guerilla_s~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.6403653   .1873148    -3.42   0.001    -1.007496   -.2732351
        dw30 |  -.0008546   .2895224    -0.00   0.998    -.5683082    .5665989
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 233 groups (2642 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1256.7306
Iteration 1:   log likelihood = -1256.0938
Iteration 2:   log likelihood = -1256.0938

Conditional fixed-effects logit                 Number of obs      =      5700
Group variable (i) : regyr                      Number of groups   =       248

                                                Obs per group: min =         2
                                                               avg =      23.0
                                                               max =        47

                                                LR chi2(1)         =      1.57
Log likelihood  = -1256.0938                    Prob > chi2        =    0.2109

------------------------------------------------------------------------------
Guerilla_s~t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.3474541    .277306    -1.25   0.210     -.890964    .1960557
------------------------------------------------------------------------------

.  global depend "Guerilla_end";

.  stuff;

note: multiple positive outcomes within groups encountered.
note: 205 groups (2212 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood =  -1312.026
Iteration 1:   log likelihood = -1311.7158
Iteration 2:   log likelihood = -1311.7158

Conditional fixed-effects logit                 Number of obs      =      5910
Group variable (i) : regyr                      Number of groups   =       262

                                                Obs per group: min =         3
                                                               avg =      22.6
                                                               max =        47

                                                LR chi2(1)         =      0.62
Log likelihood  = -1311.7158                    Prob > chi2        =    0.4295

------------------------------------------------------------------------------
Guerilla_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |   .2171589   .2749432     0.79   0.430    -.3217199    .7560377
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 205 groups (2216 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1313.9738
Iteration 1:   log likelihood = -1309.5994
Iteration 2:   log likelihood = -1309.5993

Conditional fixed-effects logit                 Number of obs      =      5916
Group variable (i) : regyr                      Number of groups   =       262

                                                Obs per group: min =         3
                                                               avg =      22.6
                                                               max =        47

                                                LR chi2(1)         =     10.09
Log likelihood  = -1309.5993                    Prob > chi2        =    0.0015

------------------------------------------------------------------------------
Guerilla_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.5470308   .1721356    -3.18   0.001    -.8844103   -.2096513
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 205 groups (2208 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1313.6728
Iteration 1:   log likelihood = -1309.1585
Iteration 2:   log likelihood = -1309.1585

Conditional fixed-effects logit                 Number of obs      =      5906
Group variable (i) : regyr                      Number of groups   =       262

                                                Obs per group: min =         3
                                                               avg =      22.5
                                                               max =        47

                                                LR chi2(2)         =     10.39
Log likelihood  = -1309.1585                    Prob > chi2        =    0.0056

------------------------------------------------------------------------------
Guerilla_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.5951576   .1948629    -3.05   0.002    -.9770819   -.2132333
           s |   .0799532    .154377     0.52   0.605    -.2226203    .3825266
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 205 groups (2208 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1313.7062
Iteration 1:   log likelihood = -1309.4627
Iteration 2:   log likelihood = -1309.4625

Conditional fixed-effects logit                 Number of obs      =      5906
Group variable (i) : regyr                      Number of groups   =       262

                                                Obs per group: min =         3
                                                               avg =      22.5
                                                               max =        47

                                                LR chi2(1)         =      9.78
Log likelihood  = -1309.4625                    Prob > chi2        =    0.0018

------------------------------------------------------------------------------
Guerilla_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -.5371821   .1716315    -3.13   0.002    -.8735737   -.2007905
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 89 groups (1195 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -543.92633
Iteration 1:   log likelihood = -543.75932
Iteration 2:   log likelihood = -543.75931

Conditional fixed-effects logit                 Number of obs      =      2767
Group variable (i) : regyr                      Number of groups   =       105

                                                Obs per group: min =         7
                                                               avg =      26.4
                                                               max =        44

                                                LR chi2(3)         =      0.34
Log likelihood  = -543.75931                    Prob > chi2        =    0.9527

------------------------------------------------------------------------------
Guerilla_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   .1992769   .8194766     0.24   0.808    -1.406868    1.805422
      clcost |   .3658865   .8636559     0.42   0.672    -1.326848    2.058621
     clcostw |  -.2523067   1.171678    -0.22   0.830    -2.548753     2.04414
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 187 groups (1933 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1183.2133
Iteration 1:   log likelihood = -1177.4181
Iteration 2:   log likelihood = -1177.2701
Iteration 3:   log likelihood =   -1177.27

Conditional fixed-effects logit                 Number of obs      =      5099
Group variable (i) : regyr                      Number of groups   =       238

                                                Obs per group: min =         3
                                                               avg =      21.4
                                                               max =        46

                                                LR chi2(3)         =     14.20
Log likelihood  =   -1177.27                    Prob > chi2        =    0.0026

------------------------------------------------------------------------------
Guerilla_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.262201   .3586394    -3.52   0.000    -1.965121   -.5592803
    emigcost |  -.8478455   .3240809    -2.62   0.009    -1.483032   -.2126587
   wemigcost |   .9511326   .4116241     2.31   0.021     .1443642    1.757901
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 113 groups (1501 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -684.96406
Iteration 1:   log likelihood =  -661.7491
Iteration 2:   log likelihood = -661.66049
Iteration 3:   log likelihood = -661.66048

Conditional fixed-effects logit                 Number of obs      =      3212
Group variable (i) : regyr                      Number of groups   =       152

                                                Obs per group: min =         3
                                                               avg =      21.1
                                                               max =        45

                                                LR chi2(3)         =     52.44
Log likelihood  = -661.66048                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
Guerilla_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.0361158   .2763891    -0.13   0.896    -.5778285     .505597
     lpop_WB |   .2672364   .0418922     6.38   0.000     .1851292    .3493436
      lgdpWB |  -.1116399   .0673468    -1.66   0.097    -.2436371    .0203573
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 205 groups (2212 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1311.2423
Iteration 1:   log likelihood = -1305.2486
Iteration 2:   log likelihood = -1305.2479

Conditional fixed-effects logit                 Number of obs      =      5910
Group variable (i) : regyr                      Number of groups   =       262

                                                Obs per group: min =         3
                                                               avg =      22.6
                                                               max =        47

                                                LR chi2(2)         =     13.56
Log likelihood  = -1305.2479                    Prob > chi2        =    0.0011

------------------------------------------------------------------------------
Guerilla_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.6575738   .1831947    -3.59   0.000    -1.016629   -.2985188
        dw30 |   .5414719   .2831744     1.91   0.056    -.0135398    1.096484
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 205 groups (2212 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood =  -1312.026
Iteration 1:   log likelihood = -1311.7158
Iteration 2:   log likelihood = -1311.7158

Conditional fixed-effects logit                 Number of obs      =      5910
Group variable (i) : regyr                      Number of groups   =       262

                                                Obs per group: min =         3
                                                               avg =      22.6
                                                               max =        47

                                                LR chi2(1)         =      0.62
Log likelihood  = -1311.7158                    Prob > chi2        =    0.4295

------------------------------------------------------------------------------
Guerilla_end |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |   .2171589   .2749432     0.79   0.430    -.3217199    .7560377
------------------------------------------------------------------------------

.  global depend "CL_war_start";

.  stuff;

note: multiple positive outcomes within groups encountered.
note: 1068 groups (13773 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -726.01648
Iteration 1:   log likelihood = -723.80906
Iteration 2:   log likelihood = -723.80854

Conditional fixed-effects logit                 Number of obs      =      4568
Group variable (i) : regyr                      Number of groups   =       186

                                                Obs per group: min =         3
                                                               avg =      24.6
                                                               max =        51

                                                LR chi2(1)         =      4.51
Log likelihood  = -723.80854                    Prob > chi2        =    0.0338

------------------------------------------------------------------------------
CL_war_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.9280291   .4322147    -2.15   0.032    -1.775154   -.0809039
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 1070 groups (14257 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -735.87702
Iteration 1:   log likelihood = -726.40625
Iteration 2:   log likelihood = -726.39919

Conditional fixed-effects logit                 Number of obs      =      4701
Group variable (i) : regyr                      Number of groups   =       187

                                                Obs per group: min =         3
                                                               avg =      25.1
                                                               max =        52

                                                LR chi2(1)         =     19.55
Log likelihood  = -726.39919                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
CL_war_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.145075    .262599    -4.36   0.000    -1.659759   -.6303899
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 911 groups (9075 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -598.30735
Iteration 1:   log likelihood = -583.00612
Iteration 2:   log likelihood = -582.95528
Iteration 3:   log likelihood = -582.95528

Conditional fixed-effects logit                 Number of obs      =      3366
Group variable (i) : regyr                      Number of groups   =       171

                                                Obs per group: min =         2
                                                               avg =      19.7
                                                               max =        47

                                                LR chi2(2)         =     32.06
Log likelihood  = -582.95528                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
CL_war_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.538421   .3045454    -5.05   0.000    -2.135319    -.941523
           s |  -.0416014   .2065532    -0.20   0.840    -.4464382    .3632354
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 911 groups (9075 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -598.28944
Iteration 1:   log likelihood = -582.74364
Iteration 2:   log likelihood = -582.71246
Iteration 3:   log likelihood = -582.71246

Conditional fixed-effects logit                 Number of obs      =      3366
Group variable (i) : regyr                      Number of groups   =       171

                                                Obs per group: min =         2
                                                               avg =      19.7
                                                               max =        47

                                                LR chi2(1)         =     32.55
Log likelihood  = -582.71246                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
CL_war_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -1.534572   .2763906    -5.55   0.000    -2.076288   -.9928568
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 143 groups (2548 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -247.29187
Iteration 1:   log likelihood = -236.43976
Iteration 2:   log likelihood = -236.23561
Iteration 3:   log likelihood = -236.23532
Iteration 4:   log likelihood = -236.23532

Conditional fixed-effects logit                 Number of obs      =      1532
Group variable (i) : regyr                      Number of groups   =        53

                                                Obs per group: min =         7
                                                               avg =      28.9
                                                               max =        44

                                                LR chi2(3)         =     22.98
Log likelihood  = -236.23532                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
CL_war_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   .0514262   1.399453     0.04   0.971    -2.691451    2.794303
      clcost |   2.748687    1.27978     2.15   0.032     .2403644     5.25701
     clcostw |  -1.219747   1.857688    -0.66   0.511    -4.860749    2.421255
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 1035 groups (13371 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -696.58014
Iteration 1:   log likelihood = -687.19034
Iteration 2:   log likelihood = -687.07088
Iteration 3:   log likelihood = -687.07082
Iteration 4:   log likelihood = -687.07082

Conditional fixed-effects logit                 Number of obs      =      4429
Group variable (i) : regyr                      Number of groups   =       180

                                                Obs per group: min =         3
                                                               avg =      24.6
                                                               max =        52

                                                LR chi2(3)         =     19.49
Log likelihood  = -687.07082                    Prob > chi2        =    0.0002

------------------------------------------------------------------------------
CL_war_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.102762   .5631852    -1.96   0.050    -2.206584    .0010612
    emigcost |  -.5341441   .4001639    -1.33   0.182    -1.318451    .2501626
   wemigcost |  -.0073404   .6214139    -0.01   0.991    -1.225289    1.210609
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 227 groups (3910 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -212.16577
Iteration 1:   log likelihood = -186.24192
Iteration 2:   log likelihood = -185.23922
Iteration 3:   log likelihood = -185.23346
Iteration 4:   log likelihood = -185.23346

Conditional fixed-effects logit                 Number of obs      =      1335
Group variable (i) : regyr                      Number of groups   =        52

                                                Obs per group: min =         7
                                                               avg =      25.7
                                                               max =        45

                                                LR chi2(3)         =     55.10
Log likelihood  = -185.23346                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
CL_war_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.7585939   .5182636    -1.46   0.143    -1.774372     .257184
     lpop_WB |   .5097767   .0885841     5.75   0.000     .3361551    .6833983
      lgdpWB |  -.2739543   .1432147    -1.91   0.056    -.5546499    .0067413
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 1068 groups (13773 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood =  -725.7527
Iteration 1:   log likelihood =  -715.7694
Iteration 2:   log likelihood = -715.75507
Iteration 3:   log likelihood = -715.75507

Conditional fixed-effects logit                 Number of obs      =      4568
Group variable (i) : regyr                      Number of groups   =       186

                                                Obs per group: min =         3
                                                               avg =      24.6
                                                               max =        51

                                                LR chi2(2)         =     20.61
Log likelihood  = -715.75507                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
CL_war_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.094113   .2771239    -3.95   0.000    -1.637266   -.5509598
        dw30 |  -.3321649   .4504421    -0.74   0.461    -1.215015    .5506855
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 1068 groups (13773 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -726.01648
Iteration 1:   log likelihood = -723.80906
Iteration 2:   log likelihood = -723.80854

Conditional fixed-effects logit                 Number of obs      =      4568
Group variable (i) : regyr                      Number of groups   =       186

                                                Obs per group: min =         3
                                                               avg =      24.6
                                                               max =        51

                                                LR chi2(1)         =      4.51
Log likelihood  = -723.80854                    Prob > chi2        =    0.0338

------------------------------------------------------------------------------
CL_war_start |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |  -.9280291   .4322147    -2.15   0.032    -1.775154   -.0809039
------------------------------------------------------------------------------

.  global depend "collapse";

.  stuff;

note: multiple positive outcomes within groups encountered.
note: 518 groups (1195 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -175.33741
Iteration 1:   log likelihood = -173.54892
Iteration 2:   log likelihood = -173.54658

Conditional fixed-effects logit                 Number of obs      =       457
Group variable (i) : regyr                      Number of groups   =        82

                                                Obs per group: min =         2
                                                               avg =       5.6
                                                               max =        21

                                                LR chi2(1)         =      3.58
Log likelihood  = -173.54658                    Prob > chi2        =    0.0584

------------------------------------------------------------------------------
    collapse |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |   .8916584   .4792706     1.86   0.063    -.0476947    1.831011
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 520 groups (1218 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -178.89816
Iteration 1:   log likelihood =   -171.792
Iteration 2:   log likelihood = -171.74241
Iteration 3:   log likelihood =  -171.7424

Conditional fixed-effects logit                 Number of obs      =       474
Group variable (i) : regyr                      Number of groups   =        84

                                                Obs per group: min =         2
                                                               avg =       5.6
                                                               max =        21

                                                LR chi2(1)         =     17.17
Log likelihood  =  -171.7424                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    collapse |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |    -2.0073   .5117324    -3.92   0.000    -3.010277   -1.004323
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 430 groups (891 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -121.48174
Iteration 1:   log likelihood = -115.68995
Iteration 2:   log likelihood = -115.66247
Iteration 3:   log likelihood = -115.66247

Conditional fixed-effects logit                 Number of obs      =       333
Group variable (i) : regyr                      Number of groups   =        67

                                                Obs per group: min =         2
                                                               avg =       5.0
                                                               max =        21

                                                LR chi2(2)         =     13.80
Log likelihood  = -115.66247                    Prob > chi2        =    0.0010

------------------------------------------------------------------------------
    collapse |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.992811   .6326582    -3.15   0.002    -3.232798   -.7528234
           s |  -.0654671   .3397793    -0.19   0.847    -.7314223     .600488
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 430 groups (891 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -121.60973
Iteration 1:   log likelihood = -116.49982
Iteration 2:   log likelihood = -116.48397
Iteration 3:   log likelihood = -116.48397

Conditional fixed-effects logit                 Number of obs      =       333
Group variable (i) : regyr                      Number of groups   =        67

                                                Obs per group: min =         2
                                                               avg =       5.0
                                                               max =        21

                                                LR chi2(1)         =     12.16
Log likelihood  = -116.48397                    Prob > chi2        =    0.0005

------------------------------------------------------------------------------
    collapse |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -1.875561   .5600734    -3.35   0.001    -2.973284   -.7778369
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 107 groups (299 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -89.080581
Iteration 1:   log likelihood = -82.108349
Iteration 2:   log likelihood = -82.099685
Iteration 3:   log likelihood = -82.099684

Conditional fixed-effects logit                 Number of obs      =       240
Group variable (i) : regyr                      Number of groups   =        41

                                                Obs per group: min =         2
                                                               avg =       5.9
                                                               max =        21

                                                LR chi2(3)         =     18.69
Log likelihood  = -82.099684                    Prob > chi2        =    0.0003

------------------------------------------------------------------------------
    collapse |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   3.616658    2.71994     1.33   0.184    -1.714327    8.947643
      clcost |   5.293857   1.774289     2.98   0.003     1.816315    8.771399
     clcostw |  -6.988365   3.857533    -1.81   0.070    -14.54899    .5722613
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 493 groups (1138 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -152.64691
Iteration 1:   log likelihood = -132.89135
Iteration 2:   log likelihood = -132.28225
Iteration 3:   log likelihood = -132.27312
Iteration 4:   log likelihood = -132.27312

Conditional fixed-effects logit                 Number of obs      =       418
Group variable (i) : regyr                      Number of groups   =        78

                                                Obs per group: min =         2
                                                               avg =       5.4
                                                               max =        21

                                                LR chi2(3)         =     45.73
Log likelihood  = -132.27312                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    collapse |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   .5842311   1.364579     0.43   0.669    -2.090294    3.258756
    emigcost |   2.911261   .7229945     4.03   0.000     1.494218    4.328305
   wemigcost |  -3.288819   1.443536    -2.28   0.023    -6.118098   -.4595401
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 166 groups (427 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -48.210718
Iteration 1:   log likelihood = -40.090777
Iteration 2:   log likelihood = -39.240809
Iteration 3:   log likelihood =  -39.22471
Iteration 4:   log likelihood = -39.224702

Conditional fixed-effects logit                 Number of obs      =       152
Group variable (i) : regyr                      Number of groups   =        20

                                                Obs per group: min =         3
                                                               avg =       7.6
                                                               max =        19

                                                LR chi2(3)         =     19.22
Log likelihood  = -39.224702                    Prob > chi2        =    0.0002

------------------------------------------------------------------------------
    collapse |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.0972639   .8861251    -0.11   0.913    -1.834037    1.639509
     lpop_WB |  -.0071293    .194219    -0.04   0.971    -.3877916    .3735329
      lgdpWB |  -1.809259    .519212    -3.48   0.000    -2.826896   -.7916226
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 518 groups (1195 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -174.04289
Iteration 1:   log likelihood = -159.52338
Iteration 2:   log likelihood = -159.35373
Iteration 3:   log likelihood = -159.35359

Conditional fixed-effects logit                 Number of obs      =       457
Group variable (i) : regyr                      Number of groups   =        82

                                                Obs per group: min =         2
                                                               avg =       5.6
                                                               max =        21

                                                LR chi2(2)         =     31.97
Log likelihood  = -159.35359                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    collapse |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.898144   .5880819    -4.93   0.000    -4.050764   -1.745525
        dw30 |   1.950783   .5491315     3.55   0.000     .8745052    3.027061
------------------------------------------------------------------------------

note: multiple positive outcomes within groups encountered.
note: 518 groups (1195 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -175.33741
Iteration 1:   log likelihood = -173.54892
Iteration 2:   log likelihood = -173.54658

Conditional fixed-effects logit                 Number of obs      =       457
Group variable (i) : regyr                      Number of groups   =        82

                                                Obs per group: min =         2
                                                               avg =       5.6
                                                               max =        21

                                                LR chi2(1)         =      3.58
Log likelihood  = -173.54658                    Prob > chi2        =    0.0584

------------------------------------------------------------------------------
    collapse |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        dw30 |   .8916584   .4792706     1.86   0.063    -.0476947    1.831011
------------------------------------------------------------------------------

.  xtlogit revolution W AntiGovDem GenStrikes RIOTS, fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 72 groups (838 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1130.2463
Iteration 1:   log likelihood = -1039.8183
Iteration 2:   log likelihood = -1039.5084
Iteration 3:   log likelihood = -1039.5084

Conditional fixed-effects logit                 Number of obs      =      3147
Group variable (i) : regyr                      Number of groups   =       168

                                                Obs per group: min =         2
                                                               avg =      18.7
                                                               max =        43

                                                LR chi2(4)         =    236.45
Log likelihood  = -1039.5084                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.639113   .1893008   -13.94   0.000    -3.010136   -2.268091
  AntiGovDem |  -.0114047    .026483    -0.43   0.667    -.0633104     .040501
  GenStrikes |   .1394651   .0795852     1.75   0.080     -.016519    .2954492
       RIOTS |      .1013   .0294741     3.44   0.001     .0435317    .1590682
------------------------------------------------------------------------------

. xtlogit revolution W dw30 AntiGovDem GenStrikes RIOTS, fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 72 groups (838 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1128.1253
Iteration 1:   log likelihood = -1035.1684
Iteration 2:   log likelihood = -1034.8905
Iteration 3:   log likelihood = -1034.8905

Conditional fixed-effects logit                 Number of obs      =      3147
Group variable (i) : regyr                      Number of groups   =       168

                                                Obs per group: min =         2
                                                               avg =      18.7
                                                               max =        43

                                                LR chi2(5)         =    245.68
Log likelihood  = -1034.8905                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -2.405447   .2032601   -11.83   0.000     -2.80383   -2.007065
        dw30 |   -.840001   .2795937    -3.00   0.003    -1.387994   -.2920075
  AntiGovDem |   -.007908   .0265452    -0.30   0.766    -.0599356    .0441197
  GenStrikes |   .1499214   .0791287     1.89   0.058     -.005168    .3050107
       RIOTS |   .0935427   .0295615     3.16   0.002     .0356032    .1514823
------------------------------------------------------------------------------

. xtlogit revolution W S clcost incWB WB_growth, fe i(regyr) or;

note: multiple positive outcomes within groups encountered.
note: 59 groups (387 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1090.6797
Iteration 1:   log likelihood = -980.67873
Iteration 2:   log likelihood = -977.97168
Iteration 3:   log likelihood = -977.96097

Conditional fixed-effects logit                 Number of obs      =      2934
Group variable (i) : regyr                      Number of groups   =       135

                                                Obs per group: min =         2
                                                               avg =      21.7
                                                               max =        42

                                                LR chi2(5)         =    282.93
Log likelihood  = -977.96097                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
  revolution |         OR   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   .2030708   .0734753    -4.41   0.000     .0999229     .412696
           S |   .5060701   .0944107    -3.65   0.000     .3510861    .7294707
      clcost |   4.370799   1.546101     4.17   0.000     2.185052    8.742988
       incWB |   .6297758   .0405118    -7.19   0.000     .5551757    .7144002
   WB_growth |   .9569592    .008427    -5.00   0.000     .9405842    .9736191
------------------------------------------------------------------------------

. xtlogit guerilla W AntiGovDem GenStrikes RIOTS, fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 51 groups (360 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood =   -1306.25
Iteration 1:   log likelihood = -1274.1742
Iteration 2:   log likelihood = -1273.6712
Iteration 3:   log likelihood = -1273.6708

Conditional fixed-effects logit                 Number of obs      =      3625
Group variable (i) : regyr                      Number of groups   =       189

                                                Obs per group: min =         3
                                                               avg =      19.2
                                                               max =        43

                                                LR chi2(4)         =     98.25
Log likelihood  = -1273.6708                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.5685608   .1611044    -3.53   0.000    -.8843195    -.252802
  AntiGovDem |  -.0116351   .0250437    -0.46   0.642    -.0607199    .0374496
  GenStrikes |   .3863263    .075173     5.14   0.000       .23899    .5336627
       RIOTS |   .1255493   .0279758     4.49   0.000     .0707177     .180381
------------------------------------------------------------------------------

. xtlogit guerilla W dw30 AntiGovDem GenStrikes RIOTS, fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 51 groups (360 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1306.1145
Iteration 1:   log likelihood = -1273.6568
Iteration 2:   log likelihood =  -1273.131
Iteration 3:   log likelihood = -1273.1305

Conditional fixed-effects logit                 Number of obs      =      3625
Group variable (i) : regyr                      Number of groups   =       189

                                                Obs per group: min =         3
                                                               avg =      19.2
                                                               max =        43

                                                LR chi2(5)         =     99.33
Log likelihood  = -1273.1305                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
    guerilla |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.6292254   .1715021    -3.67   0.000    -.9653634   -.2930874
        dw30 |   .2667252     .25628     1.04   0.298    -.2355744    .7690249
  AntiGovDem |   -.012704   .0249904    -0.51   0.611    -.0616842    .0362763
  GenStrikes |   .3843702   .0752704     5.11   0.000     .2368429    .5318975
       RIOTS |   .1273768   .0280349     4.54   0.000     .0724294    .1823243
------------------------------------------------------------------------------

. xtlogit clwar W AntiGovDem GenStrikes RIOTS, fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 95 groups (1090 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -801.20404
Iteration 1:   log likelihood = -769.73819
Iteration 2:   log likelihood = -767.74825
Iteration 3:   log likelihood = -767.74277

Conditional fixed-effects logit                 Number of obs      =      2895
Group variable (i) : regyr                      Number of groups   =       145

                                                Obs per group: min =         3
                                                               avg =      20.0
                                                               max =        43

                                                LR chi2(4)         =     91.12
Log likelihood  = -767.74277                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.6316258   .2211081    -2.86   0.004     -1.06499   -.1982618
  AntiGovDem |   .1365559   .0315524     4.33   0.000     .0747142    .1983975
  GenStrikes |   .1491444   .0828245     1.80   0.072    -.0131886    .3114774
       RIOTS |   .0650845    .030277     2.15   0.032     .0057427    .1244262
------------------------------------------------------------------------------

. xtlogit clwar W dw30 AntiGovDem GenStrikes RIOTS, fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 95 groups (1090 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood =  -801.2444
Iteration 1:   log likelihood = -769.70153
Iteration 2:   log likelihood = -767.70864
Iteration 3:   log likelihood = -767.70317

Conditional fixed-effects logit                 Number of obs      =      2895
Group variable (i) : regyr                      Number of groups   =       145

                                                Obs per group: min =         3
                                                               avg =      20.0
                                                               max =        43

                                                LR chi2(5)         =     91.20
Log likelihood  = -767.70317                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
       clwar |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.6547457   .2359628    -2.77   0.006    -1.117224    -.192267
        dw30 |   .0983305   .3492683     0.28   0.778    -.5862229    .7828839
  AntiGovDem |   .1361004   .0315785     4.31   0.000     .0742077     .197993
  GenStrikes |   .1477342   .0829512     1.78   0.075    -.0148472    .3103156
       RIOTS |   .0659939   .0304563     2.17   0.030     .0063007    .1256871
------------------------------------------------------------------------------

. xtreg F3S Revol_start Revol_end, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      7342
Group variable (i) : regyr                      Number of groups   =       428

R-sq:  within  = 0.0033                         Obs per group: min =         1
       between = 0.0003                                        avg =      17.2
       overall = 0.0035                                        max =        47

                                                F(2,6912)          =     11.33
corr(u_i, Xb)  = 0.0045                         Prob > F           =    0.0000

------------------------------------------------------------------------------
         F3S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 Revol_start |   .0524928    .014124     3.72   0.000     .0248055    .0801801
   Revol_end |   .0470447   .0140457     3.35   0.001     .0195107    .0745786
       _cons |   -.004035   .0039174    -1.03   0.303    -.0117144    .0036443
-------------+----------------------------------------------------------------
     sigma_u |  .10276815
     sigma_e |  .30659975
         rho |  .10100247   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(427, 6912) =     1.15           Prob > F = 0.0198

. xtreg F3S Revol_start Revol_end if F3S~=0, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =       832
Group variable (i) : regyr                      Number of groups   =       281

R-sq:  within  = 0.0196                         Obs per group: min =         1
       between = 0.0123                                        avg =       3.0
       overall = 0.0166                                        max =        14

                                                F(2,549)           =      5.49
corr(u_i, Xb)  = -0.0247                        Prob > F           =    0.0044

------------------------------------------------------------------------------
         F3S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 Revol_start |   .3025073    .111005     2.73   0.007     .0844608    .5205539
   Revol_end |   .2757942   .1124713     2.45   0.015     .0548676    .4967209
       _cons |  -.0526188   .0399458    -1.32   0.188    -.1310841    .0258466
-------------+----------------------------------------------------------------
     sigma_u |  .67467091
     sigma_e |  .89068154
         rho |  .36458379   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(280, 549) =     1.13            Prob > F = 0.1193

. xtreg F3S Revol_start Revol_end  W, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      7342
Group variable (i) : regyr                      Number of groups   =       428

R-sq:  within  = 0.0292                         Obs per group: min =         1
       between = 0.0094                                        avg =      17.2
       overall = 0.0247                                        max =        47

                                                F(3,6911)          =     69.21
corr(u_i, Xb)  = -0.1333                        Prob > F           =    0.0000

------------------------------------------------------------------------------
         F3S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 Revol_start |   .0240629   .0140966     1.71   0.088    -.0035708    .0516966
   Revol_end |    .023535   .0139708     1.68   0.092     -.003852     .050922
           W |  -.1881498   .0138569   -13.58   0.000    -.2153136    -.160986
       _cons |   .1104382   .0092751    11.91   0.000     .0922562    .1286203
-------------+----------------------------------------------------------------
     sigma_u |  .10375439
     sigma_e |  .30261213
         rho |  .10518928   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(427, 6911) =     1.23           Prob > F = 0.0010

. xtreg F3S Revol_start Revol_end Revol_startW W, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      7342
Group variable (i) : regyr                      Number of groups   =       428

R-sq:  within  = 0.0311                         Obs per group: min =         1
       between = 0.0104                                        avg =      17.2
       overall = 0.0267                                        max =        47

                                                F(4,6910)          =     55.52
corr(u_i, Xb)  = -0.1249                        Prob > F           =    0.0000

------------------------------------------------------------------------------
         F3S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 Revol_start |    .098377   .0243189     4.05   0.000     .0507044    .1460496
   Revol_end |   .0255078   .0139675     1.83   0.068    -.0018728    .0528885
Revol_startW |  -.1739976   .0464202    -3.75   0.000    -.2649954   -.0829998
           W |  -.1736583   .0143736   -12.08   0.000    -.2018349   -.1454817
       _cons |   .1015978   .0095618    10.63   0.000     .0828538    .1203418
-------------+----------------------------------------------------------------
     sigma_u |   .1035257
     sigma_e |  .30232683
         rho |  .10495169   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(427, 6910) =     1.23           Prob > F = 0.0010

. xtreg F3S Revol_start Revol_end Revol_startW Revol_endW W, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      7342
Group variable (i) : regyr                      Number of groups   =       428

R-sq:  within  = 0.0342                         Obs per group: min =         1
       between = 0.0142                                        avg =      17.2
       overall = 0.0298                                        max =        47

                                                F(5,6909)          =     48.87
corr(u_i, Xb)  = -0.1146                        Prob > F           =    0.0000

------------------------------------------------------------------------------
         F3S |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 Revol_start |   .1095648   .0244016     4.49   0.000     .0617301    .1573995
   Revol_end |   .1251606   .0255694     4.89   0.000     .0750367    .1752846
Revol_startW |  -.1936477   .0465433    -4.16   0.000    -.2848869   -.1024085
  Revol_endW |  -.2177934   .0468378    -4.65   0.000    -.3096099   -.1259769
           W |  -.1546975   .0149202   -10.37   0.000    -.1839456   -.1254494
       _cons |   .0900535   .0098651     9.13   0.000      .070715     .109392
-------------+----------------------------------------------------------------
     sigma_u |  .10300459
     sigma_e |  .30187671
         rho |  .10428542   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(427, 6909) =     1.23           Prob > F = 0.0011

. gen W_WB_gdppc_con=W*WB_gdppc_con;
(14434 missing values generated)

. xtreg actsum W W_WB_gdppc_con WB_gdppc_con , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      5246
Group variable (i) : regyr                      Number of groups   =       279

R-sq:  within  = 0.0147                         Obs per group: min =         1
       between = 0.0234                                        avg =      18.8
       overall = 0.0102                                        max =        45

                                                F(3,4964)          =     24.62
corr(u_i, Xb)  = -0.1352                        Prob > F           =    0.0000

------------------------------------------------------------------------------
      actsum |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.3470498   .0658946    -5.27   0.000    -.4762323   -.2178672
W_WB_gdppc~n |  -3.56e-06   6.77e-06    -0.53   0.599    -.0000168    9.71e-06
WB_gdppc_~95 |  -5.42e-06   6.10e-06    -0.89   0.374    -.0000174    6.53e-06
       _cons |   1.017456   .0406506    25.03   0.000     .9377633     1.09715
-------------+----------------------------------------------------------------
     sigma_u |  .39004282
     sigma_e |  1.0113211
         rho |  .12948585   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(278, 4964) =     2.29           Prob > F = 0.0000

. test W+W_WB_gdppc_con+WB_gdppc_con=0;

 ( 1)  W + W_WB_gdppc_con + WB_gdppc_constUS95 = 0.0

       F(  1,  4964) =   27.74
            Prob > F =    0.0000


. xtreg actsumbig W W_WB_gdppc_con WB_gdppc_con , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      5246
Group variable (i) : regyr                      Number of groups   =       279

R-sq:  within  = 0.0540                         Obs per group: min =         1
       between = 0.2462                                        avg =      18.8
       overall = 0.0618                                        max =        45

                                                F(3,4964)          =     94.49
corr(u_i, Xb)  = -0.0948                        Prob > F           =    0.0000

------------------------------------------------------------------------------
   actsumbig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.4010641     .03466   -11.57   0.000    -.4690131   -.3331152
W_WB_gdppc~n |  -.0000125   3.56e-06    -3.51   0.000    -.0000195   -5.51e-06
WB_gdppc_~95 |   6.52e-06   3.21e-06     2.03   0.042     2.37e-07    .0000128
       _cons |   .5779052   .0213819    27.03   0.000     .5359872    .6198231
-------------+----------------------------------------------------------------
     sigma_u |   .2439244
     sigma_e |  .53194642
         rho |  .17373723   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(278, 4964) =     2.09           Prob > F = 0.0000

. test W+W_WB_gdppc_con+WB_gdppc_con=0;

 ( 1)  W + W_WB_gdppc_con + WB_gdppc_constUS95 = 0.0

       F(  1,  4964) =  133.91
            Prob > F =    0.0000


. xtlogit action W W_WB_gdppc_con WB_gdppc_con , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 30 groups (88 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2816.6788
Iteration 1:   log likelihood = -2776.8634
Iteration 2:   log likelihood = -2776.8396

Conditional fixed-effects logit                 Number of obs      =      5158
Group variable (i) : regyr                      Number of groups   =       249

                                                Obs per group: min =         2
                                                               avg =      20.7
                                                               max =        45

                                                LR chi2(3)         =    110.55
Log likelihood  = -2776.8396                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
      action |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -.873792   .1407466    -6.21   0.000     -1.14965   -.5979338
W_WB_gdppc~n |  -.0000432    .000014    -3.10   0.002    -.0000706   -.0000159
WB_gdppc_~95 |   .0000233   .0000123     1.90   0.058    -7.90e-07    .0000474
------------------------------------------------------------------------------

. test W+W_WB_gdppc_con+WB_gdppc_con=0;

 ( 1)  W + W_WB_gdppc_con + WB_gdppc_constUS95 = 0.0

           chi2(  1) =   38.55
         Prob > chi2 =    0.0000


. xtlogit bigaction W W_WB_gdppc_con WB_gdppc_con , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 36 groups (116 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2305.5537
Iteration 1:   log likelihood = -2194.1942
Iteration 2:   log likelihood = -2187.8079
Iteration 3:   log likelihood = -2187.6591
Iteration 4:   log likelihood =  -2187.659

Conditional fixed-effects logit                 Number of obs      =      5130
Group variable (i) : regyr                      Number of groups   =       243

                                                Obs per group: min =         2
                                                               avg =      21.1
                                                               max =        45

                                                LR chi2(3)         =    312.34
Log likelihood  =  -2187.659                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   bigaction |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -.856185   .1565084    -5.47   0.000    -1.162936   -.5494341
W_WB_gdppc~n |  -.0001626   .0000187    -8.68   0.000    -.0001993   -.0001259
WB_gdppc_~95 |   .0000676    .000014     4.81   0.000     .0000401    .0000951
------------------------------------------------------------------------------

. test W+W_WB_gdppc_con+WB_gdppc_con=0;

 ( 1)  W + W_WB_gdppc_con + WB_gdppc_constUS95 = 0.0

           chi2(  1) =   29.94
         Prob > chi2 =    0.0000


. gen WlgdpWB=W*lgdpWB;
(14435 missing values generated)

. xtlogit action W WlgdpWB lgdpWB , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 30 groups (88 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2817.4239
Iteration 1:   log likelihood = -2775.5974
Iteration 2:   log likelihood = -2775.5844

Conditional fixed-effects logit                 Number of obs      =      5157
Group variable (i) : regyr                      Number of groups   =       249

                                                Obs per group: min =         2
                                                               avg =      20.7
                                                               max =        45

                                                LR chi2(3)         =    109.95
Log likelihood  = -2775.5844                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
      action |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.6169895   .5380794    -1.15   0.252    -1.671606    .4376268
     WlgdpWB |   -.044442    .071321    -0.62   0.533    -.1842286    .0953447
      lgdpWB |  -.0848995   .0568533    -1.49   0.135    -.1963299    .0265309
------------------------------------------------------------------------------

. test W+  WlgdpWB +lgdpWB=0;

 ( 1)  W + WlgdpWB + lgdpWB = 0.0

           chi2(  1) =    2.11
         Prob > chi2 =    0.1465


. xtlogit bigaction W WlgdpWB lgdpWB , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 36 groups (116 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2306.9623
Iteration 1:   log likelihood = -2207.3252
Iteration 2:   log likelihood = -2206.1544
Iteration 3:   log likelihood = -2206.1534

Conditional fixed-effects logit                 Number of obs      =      5129
Group variable (i) : regyr                      Number of groups   =       243

                                                Obs per group: min =         2
                                                               avg =      21.1
                                                               max =        45

                                                LR chi2(3)         =    274.07
Log likelihood  = -2206.1534                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   bigaction |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   2.808522   .6193951     4.53   0.000      1.59453    4.022514
     WlgdpWB |  -.5885219   .0837945    -7.02   0.000    -.7527561   -.4242876
      lgdpWB |   .1483515   .0611738     2.43   0.015      .028453      .26825
------------------------------------------------------------------------------

. test W+  WlgdpWB +lgdpWB=0;

 ( 1)  W + WlgdpWB + lgdpWB = 0.0

           chi2(  1) =   16.37
         Prob > chi2 =    0.0001


. xtlogit action W  WSincomeresWB W_WSincomeresWB , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 24 groups (70 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2575.2574
Iteration 1:   log likelihood = -2543.3601
Iteration 2:   log likelihood = -2543.3469

Conditional fixed-effects logit                 Number of obs      =      4798
Group variable (i) : regyr                      Number of groups   =       246

                                                Obs per group: min =         2
                                                               avg =      19.5
                                                               max =        45

                                                LR chi2(3)         =     77.83
Log likelihood  = -2543.3469                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
      action |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.001713   .1311327    -7.64   0.000    -1.258728   -.7446976
WSincomere~B |  -.3352337   .0693781    -4.83   0.000    -.4712122   -.1992551
W_WSincome~B |   .2475728   .0976561     2.54   0.011     .0561704    .4389752
------------------------------------------------------------------------------

. test W + WSincomeresWB +W_WSincomeresWB=0;

 ( 1)  W + WSincomeresWB + W_WSincomeresWB = 0.0

           chi2(  1) =   60.86
         Prob > chi2 =    0.0000


. xtlogit bigaction W  WSincomeresWB W_WSincomeresWB , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 47 groups (278 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1897.7603
Iteration 1:   log likelihood = -1842.9517
Iteration 2:   log likelihood = -1842.5735
Iteration 3:   log likelihood = -1842.5735

Conditional fixed-effects logit                 Number of obs      =      4590
Group variable (i) : regyr                      Number of groups   =       223

                                                Obs per group: min =         2
                                                               avg =      20.6
                                                               max =        45

                                                LR chi2(3)         =    148.01
Log likelihood  = -1842.5735                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   bigaction |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.601631   .1536707   -10.42   0.000     -1.90282   -1.300442
WSincomere~B |  -.2996584   .0775817    -3.86   0.000    -.4517157    -.147601
W_WSincome~B |  -.0737617    .115249    -0.64   0.522    -.2996457    .1521223
------------------------------------------------------------------------------

. test W + WSincomeresWB +W_WSincomeresWB=0;

 ( 1)  W + WSincomeresWB + W_WSincomeresWB = 0.0

           chi2(  1) =  124.32
         Prob > chi2 =    0.0000


. xtreg actsum W WSincomeresWB W_WSincomeresWB , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      4868
Group variable (i) : regyr                      Number of groups   =       270

R-sq:  within  = 0.0170                         Obs per group: min =         1
       between = 0.0106                                        avg =      18.0
       overall = 0.0067                                        max =        45

                                                F(3,4595)          =     26.46
corr(u_i, Xb)  = -0.2392                        Prob > F           =    0.0000

------------------------------------------------------------------------------
      actsum |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.5095385   .0636887    -8.00   0.000     -.634399    -.384678
WSincomere~B |  -.0899087   .0334922    -2.68   0.007    -.1555695    -.024248
W_WSincome~B |   .0101898   .0471497     0.22   0.829    -.0822463    .1026258
       _cons |   1.061129    .041946    25.30   0.000     .9788951    1.143364
-------------+----------------------------------------------------------------
     sigma_u |   .4603963
     sigma_e |  1.0420256
         rho |  .16332846   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(269, 4595) =     2.45           Prob > F = 0.0000

. test W+WSincomeresWB+W_WSincomeresWB=0;

 ( 1)  W + WSincomeresWB + W_WSincomeresWB = 0.0

       F(  1,  4595) =   75.23
            Prob > F =    0.0000


. xtreg actsumbig W WSincomeresWB W_WSincomeresWB , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      4868
Group variable (i) : regyr                      Number of groups   =       270

R-sq:  within  = 0.0450                         Obs per group: min =         1
       between = 0.1456                                        avg =      18.0
       overall = 0.0539                                        max =        45

                                                F(3,4595)          =     72.11
corr(u_i, Xb)  = -0.1283                        Prob > F           =    0.0000

------------------------------------------------------------------------------
   actsumbig |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.4436103   .0320811   -13.83   0.000    -.5065045    -.380716
WSincomere~B |  -.1005612   .0168706    -5.96   0.000    -.1336356   -.0674868
W_WSincome~B |   .0620872   .0237501     2.61   0.009     .0155256    .1086488
       _cons |   .5388366   .0211289    25.50   0.000     .4974138    .5802593
-------------+----------------------------------------------------------------
     sigma_u |  .24537592
     sigma_e |  .52488546
         rho |  .17934708   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(269, 4595) =     1.90           Prob > F = 0.0000

. test W+WSincomeresWB+W_WSincomeresWB=0;

 ( 1)  W + WSincomeresWB + W_WSincomeresWB = 0.0

       F(  1,  4595) =  198.45
            Prob > F =    0.0000


. xtlogit updown l3actw l3actw2 L3W l3act, fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 897 groups (8279 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2377.9613
Iteration 1:   log likelihood = -2261.8985
Iteration 2:   log likelihood = -2252.0347
Iteration 3:   log likelihood =  -2251.315
Iteration 4:   log likelihood = -2251.3086
Iteration 5:   log likelihood = -2251.3086

Conditional fixed-effects logit                 Number of obs      =     10514
Group variable (i) : regyr                      Number of groups   =       461

                                                Obs per group: min =         2
                                                               avg =      22.8
                                                               max =        51

                                                LR chi2(4)         =    274.49
Log likelihood  = -2251.3086                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
      updown |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      l3actw |  -6.853088    1.15348    -5.94   0.000    -9.113867   -4.592309
     l3actw2 |    5.25121   .9423624     5.57   0.000     3.404213    7.098206
         L3W |  -1.760152   .1714501   -10.27   0.000    -2.096188   -1.424116
       l3act |   2.045134   .3564605     5.74   0.000     1.346484    2.743784
------------------------------------------------------------------------------

. ologit updown012 l3actw l3actw2 L3W  l3act, cluster(regyr);

Iteration 0:   log likelihood = -9553.8445
Iteration 1:   log likelihood = -9090.9012
Iteration 2:   log likelihood = -9011.5024
Iteration 3:   log likelihood = -9011.2605
Iteration 4:   log likelihood = -9011.2605

Ordered logit estimates                           Number of obs   =      18793
                                                  Wald chi2(4)    =     877.11
                                                  Prob > chi2     =     0.0000
Log likelihood = -9011.2605                       Pseudo R2       =     0.0568

                            (standard errors adjusted for clustering on regyr)
------------------------------------------------------------------------------
             |               Robust
   updown012 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      l3actw |   -2.71393   .4138602    -6.56   0.000    -3.525081   -1.902779
     l3actw2 |   1.793184   .3785727     4.74   0.000     1.051195    2.535172
         L3W |  -1.767634   .0969378   -18.23   0.000    -1.957628   -1.577639
       l3act |   1.329805   .1387348     9.59   0.000      1.05789     1.60172
-------------+----------------------------------------------------------------
       _cut1 |  -3.540889   .0840018          (Ancillary parameters)
       _cut2 |   1.975882   .0881918 
------------------------------------------------------------------------------

. xtreg dw30  l3actw l3actw2 L3W  l3act, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =     18793
Group variable (i) : regyr                      Number of groups   =      1358

R-sq:  within  = 0.0910                         Obs per group: min =         1
       between = 0.0180                                        avg =      13.8
       overall = 0.0807                                        max =        51

                                                F(4,17431)         =    436.12
corr(u_i, Xb)  = -0.0552                        Prob > F           =    0.0000

------------------------------------------------------------------------------
        dw30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      l3actw |  -.3377064   .0191733   -17.61   0.000    -.3752879   -.3001248
     l3actw2 |   .2337404   .0179367    13.03   0.000     .1985827    .2688981
         L3W |   -.105146   .0047714   -22.04   0.000    -.1144984   -.0957935
       l3act |   .1103104   .0057513    19.18   0.000     .0990372    .1215836
       _cons |   .0498669   .0028116    17.74   0.000     .0443559    .0553779
-------------+----------------------------------------------------------------
     sigma_u |  .06588701
     sigma_e |  .13115636
         rho |  .20150772   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(1357, 17431) =     3.23         Prob > F = 0.0000

. xtlogit updown l3bigactw l3bigactw2 L3W l3bigact, fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 897 groups (8279 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2378.1467
Iteration 1:   log likelihood = -2265.7679
Iteration 2:   log likelihood =  -2258.351
Iteration 3:   log likelihood = -2257.8592
Iteration 4:   log likelihood = -2257.8553
Iteration 5:   log likelihood = -2257.8553

Conditional fixed-effects logit                 Number of obs      =     10514
Group variable (i) : regyr                      Number of groups   =       461

                                                Obs per group: min =         2
                                                               avg =      22.8
                                                               max =        51

                                                LR chi2(4)         =    261.40
Log likelihood  = -2257.8553                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
      updown |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   l3bigactw |  -5.229326   1.242965    -4.21   0.000    -7.665493    -2.79316
  l3bigactw2 |   3.358712   1.097103     3.06   0.002     1.208429    5.508996
         L3W |  -1.694987   .1615139   -10.49   0.000    -2.011548   -1.378426
    l3bigact |   1.846498   .3647205     5.06   0.000     1.131659    2.561337
------------------------------------------------------------------------------

. ologit updown012 l3bigactw l3bigactw2 L3W  l3bigact, cluster(regyr);

Iteration 0:   log likelihood = -9553.8445
Iteration 1:   log likelihood = -9107.3192
Iteration 2:   log likelihood = -9037.9155
Iteration 3:   log likelihood = -9037.6848
Iteration 4:   log likelihood = -9037.6848

Ordered logit estimates                           Number of obs   =      18793
                                                  Wald chi2(4)    =     820.10
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.6848                       Pseudo R2       =     0.0540

                            (standard errors adjusted for clustering on regyr)
------------------------------------------------------------------------------
             |               Robust
   updown012 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   l3bigactw |  -2.108806    .493381    -4.27   0.000    -3.075815   -1.141797
  l3bigactw2 |   .8846849    .547097     1.62   0.106    -.1876055    1.956975
         L3W |  -1.727944   .0885399   -19.52   0.000    -1.901479   -1.554409
    l3bigact |   1.245894   .1442205     8.64   0.000     .9632274    1.528561
-------------+----------------------------------------------------------------
       _cut1 |  -3.566691   .0859681          (Ancillary parameters)
       _cut2 |   1.939566    .084625 
------------------------------------------------------------------------------

. xtreg dw30  l3bigactw l3bigactw2 L3W  l3bigact, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =     18793
Group variable (i) : regyr                      Number of groups   =      1358

R-sq:  within  = 0.0831                         Obs per group: min =         1
       between = 0.0178                                        avg =      13.8
       overall = 0.0724                                        max =        51

                                                F(4,17431)         =    395.13
corr(u_i, Xb)  = -0.0679                        Prob > F           =    0.0000

------------------------------------------------------------------------------
        dw30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   l3bigactw |  -.2631352   .0221785   -11.86   0.000    -.3066073   -.2196631
  l3bigactw2 |   .1679154   .0239438     7.01   0.000     .1209833    .2148476
         L3W |  -.1156282   .0045293   -25.53   0.000    -.1245061   -.1067503
    l3bigact |   .0884177   .0059465    14.87   0.000     .0767619    .1000734
       _cons |   .0571177   .0026707    21.39   0.000     .0518829    .0623526
-------------+----------------------------------------------------------------
     sigma_u |    .065807
     sigma_e |  .13172081
         rho |  .19974052   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(1357, 17431) =     3.23         Prob > F = 0.0000

. gen WorldWar=0;

. replace WorldWar=1 if year>=1914 & year<=1921;
(604 real changes made)

.  replace WorldWar=1 if year>=1939 &year<=1948;
(847 real changes made)

. xtlogit updown l3actw l3actw2 L3W l3act if WorldWar==0, fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 833 groups (7754 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2084.4438
Iteration 1:   log likelihood = -2008.9891
Iteration 2:   log likelihood = -2000.0407
Iteration 3:   log likelihood = -1998.8485
Iteration 4:   log likelihood = -1998.8166
Iteration 5:   log likelihood = -1998.8166

Conditional fixed-effects logit                 Number of obs      =      9667
Group variable (i) : regyr                      Number of groups   =       399

                                                Obs per group: min =         2
                                                               avg =      24.2
                                                               max =        51

                                                LR chi2(4)         =    182.40
Log likelihood  = -1998.8166                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
      updown |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      l3actw |  -8.059542   1.548131    -5.21   0.000    -11.09382   -5.025262
     l3actw2 |   5.982258   1.203351     4.97   0.000     3.623733    8.340783
         L3W |  -1.495505   .1869339    -8.00   0.000    -1.861888   -1.129121
       l3act |   2.410348   .4902228     4.92   0.000     1.449529    3.371167
------------------------------------------------------------------------------

. xtlogit updown l3actsum l3actsum2 l3actsumW l3actsumW2 L3W , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 897 groups (8279 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2378.0925
Iteration 1:   log likelihood = -2264.4045
Iteration 2:   log likelihood = -2262.0936
Iteration 3:   log likelihood = -2262.0779
Iteration 4:   log likelihood = -2262.0779

Conditional fixed-effects logit                 Number of obs      =     10514
Group variable (i) : regyr                      Number of groups   =       461

                                                Obs per group: min =         2
                                                               avg =      22.8
                                                               max =        51

                                                LR chi2(5)         =    252.95
Log likelihood  = -2262.0779                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
      updown |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    l3actsum |   .8175113   .2140295     3.82   0.000     .3980211    1.237001
   l3actsum2 |  -.1557646   .0381382    -4.08   0.000    -.2305142    -.081015
   l3actsumW |  -1.417232   .3329716    -4.26   0.000    -2.069845   -.7646201
  l3actsumW2 |   .3225033   .0877757     3.67   0.000      .150466    .4945406
         L3W |  -1.731896   .1731003   -10.01   0.000    -2.071166   -1.392626
------------------------------------------------------------------------------

. xtlogit updown l3bigactsum l3bigactsum2 l3bigactsumW l3bigactsumW2 L3W , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 897 groups (8279 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -2378.0243
Iteration 1:   log likelihood = -2264.6754
Iteration 2:   log likelihood = -2259.4272
Iteration 3:   log likelihood = -2259.3058
Iteration 4:   log likelihood = -2259.3057

Conditional fixed-effects logit                 Number of obs      =     10514
Group variable (i) : regyr                      Number of groups   =       461

                                                Obs per group: min =         2
                                                               avg =      22.8
                                                               max =        51

                                                LR chi2(5)         =    258.50
Log likelihood  = -2259.3057                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
      updown |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 l3bigactsum |   1.794576   .3611593     4.97   0.000     1.086717    2.502436
l3bigactsum2 |  -.4490319   .1232364    -3.64   0.000    -.6905708    -.207493
l3bigactsumW |  -2.834173   .6296434    -4.50   0.000    -4.068251   -1.600095
l3bigacts~W2 |   .9448261   .3588244     2.63   0.008     .2415431    1.648109
         L3W |  -1.679006   .1608772   -10.44   0.000    -1.994319   -1.363692
------------------------------------------------------------------------------

.   xtreg dw30 l3act if L3W==0, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2538
Group variable (i) : regyr                      Number of groups   =       932

R-sq:  within  = 0.0001                         Obs per group: min =         1
       between = 0.1034                                        avg =       2.7
       overall = 0.0658                                        max =        16

                                                F(1,1605)          =      0.17
corr(u_i, Xb)  = 0.3264                         Prob > F           =    0.6841

------------------------------------------------------------------------------
        dw30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       l3act |   .0060822   .0149479     0.41   0.684    -.0232372    .0354016
       _cons |   .0823482   .0056902    14.47   0.000     .0711872    .0935093
-------------+----------------------------------------------------------------
     sigma_u |  .15613018
     sigma_e |  .16875222
         rho |  .46120745   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(931, 1605) =     1.93           Prob > F = 0.0000

. xtreg dw30 l3act if L3W==0.25, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      4007
Group variable (i) : regyr                      Number of groups   =       985

R-sq:  within  = 0.0075                         Obs per group: min =         1
       between = 0.0642                                        avg =       4.1
       overall = 0.0281                                        max =        16

                                                F(1,3021)          =     22.96
corr(u_i, Xb)  = 0.1137                         Prob > F           =    0.0000

------------------------------------------------------------------------------
        dw30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       l3act |   .0293463   .0061248     4.79   0.000     .0173372    .0413555
       _cons |   .0150013   .0023979     6.26   0.000     .0102996     .019703
-------------+----------------------------------------------------------------
     sigma_u |  .10041063
     sigma_e |  .11614633
         rho |  .42771855   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(984, 3021) =     1.82           Prob > F = 0.0000

. xtreg dw30 l3act if L3W==0.5, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      6805
Group variable (i) : regyr                      Number of groups   =      1149

R-sq:  within  = 0.0032                         Obs per group: min =         1
       between = 0.0005                                        avg =       5.9
       overall = 0.0055                                        max =        44

                                                F(1,5655)          =     18.26
corr(u_i, Xb)  = 0.0090                         Prob > F           =    0.0000

------------------------------------------------------------------------------
        dw30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       l3act |   .0161085   .0037696     4.27   0.000     .0087186    .0234984
       _cons |  -.0083017   .0023271    -3.57   0.000    -.0128636   -.0037398
-------------+----------------------------------------------------------------
     sigma_u |  .07316205
     sigma_e |  .10779567
         rho |  .31537228   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(1148, 5655) =     1.88          Prob > F = 0.0000

. xtreg dw30 l3act if L3W==0.75, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      3583
Group variable (i) : regyr                      Number of groups   =       914

R-sq:  within  = 0.0003                         Obs per group: min =         1
       between = 0.0025                                        avg =       3.9
       overall = 0.0002                                        max =        21

                                                F(1,2668)          =      0.92
corr(u_i, Xb)  = -0.0581                        Prob > F           =    0.3367

------------------------------------------------------------------------------
        dw30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       l3act |   .0070137   .0072998     0.96   0.337    -.0073002    .0213276
       _cons |  -.0410082   .0034037   -12.05   0.000    -.0476824   -.0343341
-------------+----------------------------------------------------------------
     sigma_u |  .10973962
     sigma_e |  .14995032
         rho |  .34878433   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(913, 2668) =     1.52           Prob > F = 0.0000

. xtreg dw30 l3act if L3W==1, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1860
Group variable (i) : regyr                      Number of groups   =       489

R-sq:  within  = 0.0000                         Obs per group: min =         1
       between = 0.0028                                        avg =       3.8
       overall = 0.0027                                        max =        22

                                                F(1,1370)          =      0.00
corr(u_i, Xb)  = 0.0647                         Prob > F           =    0.9854

------------------------------------------------------------------------------
        dw30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       l3act |    .000097   .0053152     0.02   0.985    -.0103299    .0105238
       _cons |  -.0273148   .0026604   -10.27   0.000    -.0325337    -.022096
-------------+----------------------------------------------------------------
     sigma_u |  .09489444
     sigma_e |  .09042865
         rho |  .52408333   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(488, 1370) =     4.70           Prob > F = 0.0000

. #delimit ;
delimiter now ;
.  sort W;

. by W: tab f3w coup if IS_WAR~=1 &lgdpWB~=.  , all;

_______________________________________________________________________________
-> W = 0

           |         coup
       f3w |         0          1 |     Total
-----------+----------------------+----------
         0 |       204         53 |       257 
         1 |       102         22 |       124 
-----------+----------------------+----------
     Total |       306         75 |       381 

          Pearson chi2(1) =   0.4390   Pr = 0.508
 likelihood-ratio chi2(1) =   0.4451   Pr = 0.505
               Cramer's V =  -0.0339
                    gamma =  -0.0928  ASE = 0.139
          Kendall's tau-b =  -0.0339  ASE = 0.050

_______________________________________________________________________________
-> W = .25

           |         coup
       f3w |         0          1 |     Total
-----------+----------------------+----------
        -1 |        28          3 |        31 
         0 |       507         19 |       526 
         1 |        83         13 |        96 
-----------+----------------------+----------
     Total |       618         35 |       653 

          Pearson chi2(2) =  16.9754   Pr = 0.000
 likelihood-ratio chi2(2) =  13.5769   Pr = 0.001
               Cramer's V =   0.1612
                    gamma =   0.3821  ASE = 0.177
          Kendall's tau-b =   0.1066  ASE = 0.055

_______________________________________________________________________________
-> W = .5

           |         coup
       f3w |         0          1 |     Total
-----------+----------------------+----------
        -1 |        83          5 |        88 
         0 |       787          9 |       796 
         1 |        74          2 |        76 
-----------+----------------------+----------
     Total |       944         16 |       960 

          Pearson chi2(2) =  10.4836   Pr = 0.005
 likelihood-ratio chi2(2) =   7.2837   Pr = 0.026
               Cramer's V =   0.1045
                    gamma =  -0.3331  ASE = 0.281
          Kendall's tau-b =  -0.0546  ASE = 0.049

_______________________________________________________________________________
-> W = .75

           |         coup
       f3w |         0          1 |     Total
-----------+----------------------+----------
        -1 |       127          2 |       129 
         0 |      1190          5 |      1195 
         1 |        23          0 |        23 
-----------+----------------------+----------
     Total |      1340          7 |      1347 

          Pearson chi2(2) =   3.0081   Pr = 0.222
 likelihood-ratio chi2(2) =        .
               Cramer's V =   0.0473
                    gamma =  -0.6001  ASE = 0.257
          Kendall's tau-b =  -0.0458  ASE = 0.039

_______________________________________________________________________________
-> W = 1

           |    coup
       f3w |         0 |     Total
-----------+-----------+----------
        -1 |        24 |        24 
         0 |       936 |       936 
-----------+-----------+----------
     Total |       960 |       960 


_______________________________________________________________________________
-> W = .
no observations


.   by W: tab f3w coup if IS_WAR~=1   , all;

_______________________________________________________________________________
-> W = 0

           |         coup
       f3w |         0          1 |     Total
-----------+----------------------+----------
         0 |       375         91 |       466 
         1 |       175         49 |       224 
-----------+----------------------+----------
     Total |       550        140 |       690 

          Pearson chi2(1) =   0.5153   Pr = 0.473
 likelihood-ratio chi2(1) =   0.5104   Pr = 0.475
               Cramer's V =   0.0273
                    gamma =   0.0714  ASE = 0.099
          Kendall's tau-b =   0.0273  ASE = 0.039

_______________________________________________________________________________
-> W = .25

           |         coup
       f3w |         0          1 |     Total
-----------+----------------------+----------
        -1 |       150         13 |       163 
         0 |      2843        108 |      2951 
         1 |       253         46 |       299 
-----------+----------------------+----------
     Total |      3246        167 |      3413 

          Pearson chi2(2) =  83.6956   Pr = 0.000
 likelihood-ratio chi2(2) =  59.5932   Pr = 0.000
               Cramer's V =   0.1566
                    gamma =   0.3897  ASE = 0.091
          Kendall's tau-b =   0.0986  ASE = 0.026

_______________________________________________________________________________
-> W = .5

           |         coup
       f3w |         0          1 |     Total
-----------+----------------------+----------
        -1 |       299         16 |       315 
         0 |      2233         79 |      2312 
         1 |       143         14 |       157 
-----------+----------------------+----------
     Total |      2675        109 |      2784 

          Pearson chi2(2) =  13.1023   Pr = 0.001
 likelihood-ratio chi2(2) =  10.3897   Pr = 0.006
               Cramer's V =   0.0686
                    gamma =   0.0900  ASE = 0.126
          Kendall's tau-b =   0.0169  ASE = 0.024

_______________________________________________________________________________
-> W = .75

           |         coup
       f3w |         0          1 |     Total
-----------+----------------------+----------
        -1 |       373          8 |       381 
         0 |      2799         36 |      2835 
         1 |        58          2 |        60 
-----------+----------------------+----------
     Total |      3230         46 |      3276 

          Pearson chi2(2) =   3.3139   Pr = 0.191
 likelihood-ratio chi2(2) =   2.7040   Pr = 0.259
               Cramer's V =   0.0318
                    gamma =  -0.1157  ASE = 0.202
          Kendall's tau-b =  -0.0119  ASE = 0.022

_______________________________________________________________________________
-> W = 1

           |         coup
       f3w |         0          1 |     Total
-----------+----------------------+----------
        -1 |       109          0 |       109 
         0 |      1683          2 |      1685 
-----------+----------------------+----------
     Total |      1792          2 |      1794 

          Pearson chi2(1) =   0.1295   Pr = 0.719
 likelihood-ratio chi2(1) =        .
               Cramer's V =   0.0085
                    gamma =   1.0000  ASE = 0.000
          Kendall's tau-b =   0.0085  ASE = 0.003

_______________________________________________________________________________
-> W = .
no observations


.  sort ccode year;

. list ccode longname year IS_WAR if W==1 & coup==1;

          ccode                        longname       year     IS_WAR
 2515.       94                      Costa Rica       1892          .
 2542.       94                      Costa Rica       1919          .
 9645.      352                          Cyprus       1974          1

.  /* list ccode longname year IS_WAR if W==1 & f3w==-1; */
> list ccode longname year IS_WAR if W==1 & f3w==-1 & lgdpWB~=.;

          ccode                        longname       year     IS_WAR
 1036.       51                         Jamaica       1990          .
 1037.       51                         Jamaica       1991          .
 1038.       51                         Jamaica       1992          .
 3091.      101                       Venezuela       1989          .
 3092.      101                       Venezuela       1990          .
 3093.      101                       Venezuela       1991          .
 4725.      165                         Uruguay       1968          .
 4726.      165                         Uruguay       1969          .
 4727.      165                         Uruguay       1970          .
 9651.      352                          Cyprus       1980          .
 9652.      352                          Cyprus       1981          .
 9653.      352                          Cyprus       1982          .
11648.      420                          Gambia       1978          .
11649.      420                          Gambia       1979          .
11650.      420                          Gambia       1980          .
11661.      420                          Gambia       1991          .
11662.      420                          Gambia       1992          .
11663.      420                          Gambia       1993          .
15454.      666                          Israel       1964          .
15455.      666                          Israel       1965          .
15456.      666                          Israel       1966          .
18466.      820                        Malaysia       1966          .
18467.      820                        Malaysia       1967          .
18468.      820                        Malaysia       1968          .

.  xtlogit coup W , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 785 groups (7066 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1228.4604
Iteration 1:   log likelihood = -1032.4299
Iteration 2:   log likelihood = -1028.0949
Iteration 3:   log likelihood =  -1028.075

Conditional fixed-effects logit                 Number of obs      =      5901
Group variable (i) : regyr                      Number of groups   =       320

                                                Obs per group: min =         2
                                                               avg =      18.4
                                                               max =        47

                                                LR chi2(1)         =    427.76
Log likelihood  =  -1028.075                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
        coup |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -4.198374   .2331548   -18.01   0.000    -4.655349   -3.741398
------------------------------------------------------------------------------

. xtlogit coup WoverS , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 779 groups (6788 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -1183.3666
Iteration 1:   log likelihood = -1019.9464
Iteration 2:   log likelihood = -1017.2551
Iteration 3:   log likelihood = -1017.2485

Conditional fixed-effects logit                 Number of obs      =      5654
Group variable (i) : regyr                      Number of groups   =       308

                                                Obs per group: min =         2
                                                               avg =      18.4
                                                               max =        47

                                                LR chi2(1)         =    356.31
Log likelihood  = -1017.2485                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
        coup |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -3.738625   .2221302   -16.83   0.000    -4.173992   -3.303258
------------------------------------------------------------------------------

. xtlogit coup W lpop_WB WSincomeresWB , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 182 groups (2780 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -393.46156
Iteration 1:   log likelihood = -271.11958
Iteration 2:   log likelihood = -263.87964
Iteration 3:   log likelihood = -263.59076
Iteration 4:   log likelihood = -263.59003

Conditional fixed-effects logit                 Number of obs      =      2088
Group variable (i) : regyr                      Number of groups   =        88

                                                Obs per group: min =         3
                                                               avg =      23.7
                                                               max =        45

                                                LR chi2(3)         =    273.36
Log likelihood  = -263.59003                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
        coup |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -7.14682   .5881332   -12.15   0.000     -8.29954     -5.9941
     lpop_WB |  -.1426836   .0819406    -1.74   0.082    -.3032842     .017917
WSincomere~B |  -.7102828   .1418417    -5.01   0.000    -.9882874   -.4322782
------------------------------------------------------------------------------

. xtlogit coup W lpop_WB WSincomeresWB demres , fe i(regyr);

note: multiple positive outcomes within groups encountered.
note: 189 groups (2554 obs) dropped due to all positive or
      all negative outcomes.
Iteration 0:   log likelihood = -311.14751
Iteration 1:   log likelihood = -213.25771
Iteration 2:   log likelihood = -208.07564
Iteration 3:   log likelihood = -207.83499
Iteration 4:   log likelihood =  -207.8335
Iteration 5:   log likelihood =  -207.8335

Conditional fixed-effects logit                 Number of obs      =      1701
Group variable (i) : regyr                      Number of groups   =        77

                                                Obs per group: min =         5
                                                               avg =      22.1
                                                               max =        39

                                                LR chi2(4)         =    221.29
Log likelihood  =  -207.8335                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
        coup |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -6.910082   .7963115    -8.68   0.000    -8.470823    -5.34934
     lpop_WB |  -.0921018   .0953559    -0.97   0.334    -.2789959    .0947923
WSincomere~B |  -.7383002   .1642009    -4.50   0.000    -1.060128   -.4164723
      demres |    .690556    .769695     0.90   0.370    -.8180184     2.19913
------------------------------------------------------------------------------

. xtreg fwos30 coup, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =     11459
Group variable (i) : regyr                      Number of groups   =      1023

R-sq:  within  = 0.0130                         Obs per group: min =         1
       between = 0.0135                                        avg =      11.2
       overall = 0.0121                                        max =        47

                                                F(1,10435)         =    137.90
corr(u_i, Xb)  = -0.0224                        Prob > F           =    0.0000

------------------------------------------------------------------------------
      fwos30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        coup |   .0874823   .0074496    11.74   0.000     .0728797    .1020849
       _cons |  -.0025526   .0014067    -1.81   0.070      -.00531    .0002048
-------------+----------------------------------------------------------------
     sigma_u |  .05103562
     sigma_e |  .14721584
         rho |  .10728753   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(1022, 10435) =     0.86         Prob > F = 0.9991

. xtreg fwos30 coup lpop_WB lgdpWB demres, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      3848
Group variable (i) : regyr                      Number of groups   =       248

R-sq:  within  = 0.0186                         Obs per group: min =         1
       between = 0.0000                                        avg =      15.5
       overall = 0.0155                                        max =        39

                                                F(4,3596)          =     17.03
corr(u_i, Xb)  = -0.0419                        Prob > F           =    0.0000

------------------------------------------------------------------------------
      fwos30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        coup |   .1214875   .0170866     7.11   0.000     .0879872    .1549878
     lpop_WB |  -.0005049   .0018942    -0.27   0.790    -.0042188     .003209
      lgdpWB |  -.0016537   .0025952    -0.64   0.524    -.0067418    .0034344
      demres |   .0475947   .0148593     3.20   0.001     .0184611    .0767283
       _cons |   .0149209   .0379788     0.39   0.694    -.0595413    .0893831
-------------+----------------------------------------------------------------
     sigma_u |  .04595602
     sigma_e |     .16885
         rho |  .06896794   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(247, 3596) =     1.21           Prob > F = 0.0151

. xtreg fwos30 W s action if year>=1816 & year~=. , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =     11457
Group variable (i) : regyr                      Number of groups   =      1018

R-sq:  within  = 0.0778                         Obs per group: min =         1
       between = 0.0009                                        avg =      11.3
       overall = 0.0526                                        max =        47

                                                F(3,10436)         =    293.41
corr(u_i, Xb)  = -0.2674                        Prob > F           =    0.0000

------------------------------------------------------------------------------
      fwos30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.1519548   .0056613   -26.84   0.000    -.1630519   -.1408577
           s |  -.0099067   .0047177    -2.10   0.036    -.0191543    -.000659
      action |   .0098363   .0033161     2.97   0.003     .0033361    .0163366
       _cons |   .0890827     .00452    19.71   0.000     .0802228    .0979427
-------------+----------------------------------------------------------------
     sigma_u |  .05832794
     sigma_e |  .14231907
         rho |  .14381232   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(1017, 10436) =     1.12         Prob > F = 0.0052

. xtreg fwos30 W s action if year>=1816 & year~=. & WoverS<1, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      9671
Group variable (i) : regyr                      Number of groups   =      1013

R-sq:  within  = 0.1049                         Obs per group: min =         1
       between = 0.0000                                        avg =       9.5
       overall = 0.0815                                        max =        46

                                                F(3,8655)          =    337.98
corr(u_i, Xb)  = -0.1760                        Prob > F           =    0.0000

------------------------------------------------------------------------------
      fwos30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.2225626   .0075241   -29.58   0.000    -.2373116   -.2078137
           s |  -.0029898   .0050294    -0.59   0.552    -.0128486     .006869
      action |   .0120347   .0038967     3.09   0.002     .0043962    .0196732
       _cons |   .1047269    .004873    21.49   0.000     .0951746    .1142792
-------------+----------------------------------------------------------------
     sigma_u |  .06411606
     sigma_e |  .14945592
         rho |  .15543247   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(1012, 8655) =     1.06          Prob > F = 0.1049

. xtreg fwos30 W s if action==0 & year>=1816 & year~=. , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      8018
Group variable (i) : regyr                      Number of groups   =      1008

R-sq:  within  = 0.0424                         Obs per group: min =         1
       between = 0.0025                                        avg =       8.0
       overall = 0.0285                                        max =        38

                                                F(2,7008)          =    155.32
corr(u_i, Xb)  = -0.1995                        Prob > F           =    0.0000

------------------------------------------------------------------------------
      fwos30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.0993321   .0059057   -16.82   0.000    -.1109091   -.0877552
           s |  -.0077265   .0051405    -1.50   0.133    -.0178034    .0023505
       _cons |   .0567889   .0049195    11.54   0.000     .0471452    .0664327
-------------+----------------------------------------------------------------
     sigma_u |  .05633432
     sigma_e |  .12148879
         rho |  .17696657   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(1007, 7008) =     0.99          Prob > F = 0.6188

. xtreg fwos30 W s if action==0 & year>=1816 & year~=. & WoverS<1, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      6797
Group variable (i) : regyr                      Number of groups   =      1000

R-sq:  within  = 0.0644                         Obs per group: min =         1
       between = 0.0011                                        avg =       6.8
       overall = 0.0484                                        max =        37

                                                F(2,5795)          =    199.33
corr(u_i, Xb)  = -0.1489                        Prob > F           =    0.0000

------------------------------------------------------------------------------
      fwos30 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.1543432   .0079624   -19.38   0.000    -.1699525    -.138734
           s |  -.0054035   .0054447    -0.99   0.321    -.0160771    .0052701
       _cons |   .0730066   .0053351    13.68   0.000     .0625479    .0834653
-------------+----------------------------------------------------------------
     sigma_u |  .06194727
     sigma_e |   .1272054
         rho |  .19169421   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(999, 5795) =     0.99           Prob > F = 0.5582

. xtreg fnexcap30p l1coup l2coup l3coup , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2069
Group variable (i) : regyr                      Number of groups   =       185

R-sq:  within  = 0.0045                         Obs per group: min =         1
       between = 0.0961                                        avg =      11.2
       overall = 0.0067                                        max =        30

                                                F(3,1881)          =      2.84
corr(u_i, Xb)  = 0.0421                         Prob > F           =    0.0367

------------------------------------------------------------------------------
  fnexcap30p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      l1coup |   .0193959   .0345884     0.56   0.575    -.0484398    .0872315
      l2coup |   .0586193   .0349186     1.68   0.093     -.009864    .1271026
      l3coup |   .0699909   .0341241     2.05   0.040     .0030658     .136916
       _cons |   .1019047   .0048888    20.84   0.000     .0923167    .1114927
-------------+----------------------------------------------------------------
     sigma_u |  .14511477
     sigma_e |  .21588349
         rho |  .31121872   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(184, 1881) =     2.62           Prob > F = 0.0000

. xtreg fnexcap30p l1coup l2coup l3coup WoverS, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2068
Group variable (i) : regyr                      Number of groups   =       185

R-sq:  within  = 0.0050                         Obs per group: min =         1
       between = 0.0965                                        avg =      11.2
       overall = 0.0076                                        max =        30

                                                F(4,1879)          =      2.35
corr(u_i, Xb)  = 0.0474                         Prob > F           =    0.0525

------------------------------------------------------------------------------
  fnexcap30p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      l1coup |   .0257944   .0352668     0.73   0.465    -.0433718    .0949605
      l2coup |   .0640317   .0354027     1.81   0.071    -.0054011    .1334645
      l3coup |   .0741733   .0344231     2.15   0.031     .0066618    .1416848
      WoverS |    .019345   .0207127     0.93   0.350    -.0212774    .0599674
       _cons |   .0886957   .0150259     5.90   0.000     .0592265    .1181649
-------------+----------------------------------------------------------------
     sigma_u |   .1449989
     sigma_e |  .21592437
         rho |  .31079524   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(184, 1879) =     2.61           Prob > F = 0.0000

. xtreg fnexcap30p l1coup l2coup l3coup WoverS lpop_WB lgdpWB demres, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1913
Group variable (i) : regyr                      Number of groups   =       181

R-sq:  within  = 0.0129                         Obs per group: min =         1
       between = 0.0294                                        avg =      10.6
       overall = 0.0113                                        max =        29

                                                F(7,1725)          =      3.22
corr(u_i, Xb)  = -0.0035                        Prob > F           =    0.0021

------------------------------------------------------------------------------
  fnexcap30p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      l1coup |  -.0167778   .0365589    -0.46   0.646    -.0884822    .0549267
      l2coup |   .0665067   .0358533     1.85   0.064    -.0038138    .1368272
      l3coup |   .0793193   .0348028     2.28   0.023     .0110591    .1475795
      WoverS |    .005135   .0245149     0.21   0.834    -.0429471     .053217
     lpop_WB |  -.0008684    .003291    -0.26   0.792    -.0073231    .0055864
      lgdpWB |  -5.16e-06   .0052472    -0.00   0.999    -.0102966    .0102863
      demres |   .0851363   .0282982     3.01   0.003     .0296338    .1406388
       _cons |   .1105829   .0694322     1.59   0.111    -.0255972    .2467629
-------------+----------------------------------------------------------------
     sigma_u |  .14827045
     sigma_e |  .21081995
         rho |  .33094083   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(180, 1725) =     2.64           Prob > F = 0.0000

. xtreg fnexcap30p f1coup f2coup coup WoverS lpop_WB lgdpWB demres, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1937
Group variable (i) : regyr                      Number of groups   =       182

R-sq:  within  = 0.0090                         Obs per group: min =         1
       between = 0.0043                                        avg =      10.6
       overall = 0.0044                                        max =        30

                                                F(7,1748)          =      2.28
corr(u_i, Xb)  = -0.0529                        Prob > F           =    0.0260

------------------------------------------------------------------------------
  fnexcap30p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      f1coup |   .0043671   .0387863     0.11   0.910    -.0717053    .0804396
      f2coup |  -.0403766   .0351094    -1.15   0.250    -.1092373    .0284842
        coup |  -.0717489   .0419824    -1.71   0.088      -.15409    .0105922
      WoverS |  -.0256197    .024229    -1.06   0.290    -.0731405    .0219012
     lpop_WB |  -.0003584   .0032815    -0.11   0.913    -.0067944    .0060777
      lgdpWB |    .000518   .0052355     0.10   0.921    -.0097504    .0107865
      demres |   .1025887   .0280103     3.66   0.000     .0476514    .1575259
       _cons |   .1230598   .0688517     1.79   0.074    -.0119806    .2581003
-------------+----------------------------------------------------------------
     sigma_u |  .15156933
     sigma_e |  .21193808
         rho |  .33838443   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(181, 1748) =     2.65           Prob > F = 0.0000

. xtreg fnexcap30p f1coup f2coup coup , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2106
Group variable (i) : regyr                      Number of groups   =       186

R-sq:  within  = 0.0012                         Obs per group: min =         1
       between = 0.0001                                        avg =      11.3
       overall = 0.0003                                        max =        31

                                                F(3,1917)          =      0.74
corr(u_i, Xb)  = -0.0291                        Prob > F           =    0.5301

------------------------------------------------------------------------------
  fnexcap30p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      f1coup |   .0042424   .0386502     0.11   0.913    -.0715584    .0800432
      f2coup |  -.0370619   .0353137    -1.05   0.294    -.1063192    .0321954
        coup |  -.0387987   .0372951    -1.04   0.298     -.111942    .0343445
       _cons |   .1059061   .0048359    21.90   0.000     .0964219    .1153903
-------------+----------------------------------------------------------------
     sigma_u |  .14280361
     sigma_e |  .21641859
         rho |  .30333048   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(185, 1917) =     2.64           Prob > F = 0.0000

. xtreg fnexcap30p f1coup  coup , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2107
Group variable (i) : regyr                      Number of groups   =       186

R-sq:  within  = 0.0006                         Obs per group: min =         1
       between = 0.0002                                        avg =      11.3
       overall = 0.0002                                        max =        31

                                                F(2,1919)          =      0.55
corr(u_i, Xb)  = -0.0160                        Prob > F           =    0.5744

------------------------------------------------------------------------------
  fnexcap30p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      f1coup |    .000135    .038445     0.00   0.997    -.0752633    .0755333
        coup |  -.0390311   .0372881    -1.05   0.295    -.1121606    .0340983
       _cons |    .105282    .004792    21.97   0.000     .0958839    .1146801
-------------+----------------------------------------------------------------
     sigma_u |    .142788
     sigma_e |  .21638173
         rho |  .30335627   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(185, 1919) =     2.64           Prob > F = 0.0000

. xtreg fnexcap30p f1coup  coup WoverS lpop_WB lgdpWB demres, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1938
Group variable (i) : regyr                      Number of groups   =       182

R-sq:  within  = 0.0083                         Obs per group: min =         1
       between = 0.0048                                        avg =      10.6
       overall = 0.0041                                        max =        30

                                                F(6,1750)          =      2.44
corr(u_i, Xb)  = -0.0499                        Prob > F           =    0.0236

------------------------------------------------------------------------------
  fnexcap30p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      f1coup |   .0006604   .0386485     0.02   0.986    -.0751417    .0764626
        coup |  -.0708313   .0419703    -1.69   0.092    -.1531486     .011486
      WoverS |  -.0231271   .0241409    -0.96   0.338    -.0704752    .0242209
     lpop_WB |  -.0003747   .0032779    -0.11   0.909    -.0068037    .0060544
      lgdpWB |   .0008333   .0052214     0.16   0.873    -.0094074    .0110741
      demres |   .1000228   .0279098     3.58   0.000     .0452827    .1547629
       _cons |   .1183737   .0685458     1.73   0.084    -.0160666    .2528141
-------------+----------------------------------------------------------------
     sigma_u |  .15159199
     sigma_e |  .21191337
         rho |  .33850359   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(181, 1750) =     2.65           Prob > F = 0.0000

. /***** Human rights abuses *******/
> xtreg ainew W , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2754
Group variable (i) : regyr                      Number of groups   =       126

R-sq:  within  = 0.1187                         Obs per group: min =         1
       between = 0.1304                                        avg =      21.9
       overall = 0.1689                                        max =        47

                                                F(1,2627)          =    353.96
corr(u_i, Xb)  = 0.0910                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       ainew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |   -1.40506   .0746825   -18.81   0.000    -1.551503   -1.258618
       _cons |   3.218077   .0452769    71.08   0.000     3.129295    3.306859
-------------+----------------------------------------------------------------
     sigma_u |  .64078339
     sigma_e |  .98784419
         rho |  .29615671   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(125, 2627) =     4.04           Prob > F = 0.0000

. xtreg ainew  WoverS  lpop WSincomeresWB , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1851
Group variable (i) : regyr                      Number of groups   =       116

R-sq:  within  = 0.2914                         Obs per group: min =         1
       between = 0.5377                                        avg =      16.0
       overall = 0.3349                                        max =        39

                                                F(3,1732)          =    237.37
corr(u_i, Xb)  = 0.0576                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       ainew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -1.368885   .0804908   -17.01   0.000    -1.526754   -1.211015
        lpop |   .1953297   .0123679    15.79   0.000     .1710722    .2195872
WSincomere~B |  -.2221784   .0211423   -10.51   0.000    -.2636456   -.1807113
       _cons |   1.526609   .1289802    11.84   0.000     1.273635    1.779582
-------------+----------------------------------------------------------------
     sigma_u |  .50328104
     sigma_e |  .82795733
         rho |  .26980231   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(115, 1732) =     5.11           Prob > F = 0.0000

. xtreg ainew W   lpop WSincomeresWB , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1851
Group variable (i) : regyr                      Number of groups   =       116

R-sq:  within  = 0.2922                         Obs per group: min =         1
       between = 0.5320                                        avg =      16.0
       overall = 0.3378                                        max =        39

                                                F(3,1732)          =    238.36
corr(u_i, Xb)  = 0.0622                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       ainew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.361619   .0797247   -17.08   0.000    -1.517986   -1.205253
        lpop |   .1980541   .0123351    16.06   0.000     .1738608    .2222474
WSincomere~B |  -.2181588   .0210668   -10.36   0.000    -.2594779   -.1768398
       _cons |   1.487681   .1276358    11.66   0.000     1.237345    1.738018
-------------+----------------------------------------------------------------
     sigma_u |  .50518808
     sigma_e |  .82745307
         rho |  .27153606   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(115, 1732) =     5.06           Prob > F = 0.0000

. xtreg ainew W   lpop WSincomeresWB demres, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1726
Group variable (i) : regyr                      Number of groups   =       116

R-sq:  within  = 0.2980                         Obs per group: min =         1
       between = 0.4147                                        avg =      14.9
       overall = 0.3182                                        max =        37

                                                F(4,1606)          =    170.47
corr(u_i, Xb)  = -0.0626                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       ainew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.300017   .0828062   -15.70   0.000    -1.462436   -1.137597
        lpop |   .2010372   .0138894    14.47   0.000      .173794    .2282804
WSincomere~B |  -.2395272   .0217397   -11.02   0.000    -.2821684    -.196886
      demres |  -.7786537   .1052646    -7.40   0.000     -.985124   -.5721834
       _cons |   1.397355   .1420902     9.83   0.000     1.118654    1.676057
-------------+----------------------------------------------------------------
     sigma_u |  .52382591
     sigma_e |   .8145216
         rho |  .29258068   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(115, 1606) =     5.22           Prob > F = 0.0000

. xtreg sdnew W , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2754
Group variable (i) : regyr                      Number of groups   =       126

R-sq:  within  = 0.1450                         Obs per group: min =         1
       between = 0.1220                                        avg =      21.9
       overall = 0.1822                                        max =        47

                                                F(1,2627)          =    445.47
corr(u_i, Xb)  = 0.0081                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       sdnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.551413   .0735051   -21.11   0.000    -1.695547    -1.40728
       _cons |   3.117219   .0445631    69.95   0.000     3.029837    3.204601
-------------+----------------------------------------------------------------
     sigma_u |  .56342201
     sigma_e |  .97227063
         rho |   .2513904   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(125, 2627) =     3.60           Prob > F = 0.0000

. xtreg sdnew  WoverS  lpop WSincomeresWB , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1851
Group variable (i) : regyr                      Number of groups   =       116

R-sq:  within  = 0.2839                         Obs per group: min =         1
       between = 0.5312                                        avg =      16.0
       overall = 0.3486                                        max =        39

                                                F(3,1732)          =    228.93
corr(u_i, Xb)  = 0.0603                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       sdnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -1.364171   .0753649   -18.10   0.000    -1.511987   -1.216356
        lpop |   .1561004   .0115803    13.48   0.000     .1333876    .1788131
WSincomere~B |  -.2316244   .0197959   -11.70   0.000    -.2704508   -.1927979
       _cons |   1.611333   .1207665    13.34   0.000     1.374469    1.848196
-------------+----------------------------------------------------------------
     sigma_u |  .43526019
     sigma_e |  .77523127
         rho |  .23967997   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(115, 1732) =     4.61           Prob > F = 0.0000

. xtreg sdnew W   lpop WSincomeresWB , fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1851
Group variable (i) : regyr                      Number of groups   =       116

R-sq:  within  = 0.2861                         Obs per group: min =         1
       between = 0.5216                                        avg =      16.0
       overall = 0.3504                                        max =        39

                                                F(3,1732)          =    231.33
corr(u_i, Xb)  = 0.0590                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       sdnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.362578   .0745822   -18.27   0.000    -1.508859   -1.216298
        lpop |    .158689   .0115395    13.75   0.000     .1360562    .1813218
WSincomere~B |  -.2279773   .0197079   -11.57   0.000    -.2666311   -.1893234
       _cons |   1.577019   .1194028    13.21   0.000      1.34283    1.811208
-------------+----------------------------------------------------------------
     sigma_u |  .43809833
     sigma_e |  .77407969
         rho |  .24260269   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(115, 1732) =     4.62           Prob > F = 0.0000

. xtreg sdnew W   lpop WSincomeresWB demres, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1726
Group variable (i) : regyr                      Number of groups   =       116

R-sq:  within  = 0.3205                         Obs per group: min =         1
       between = 0.3902                                        avg =      14.9
       overall = 0.3456                                        max =        37

                                                F(4,1606)          =    189.39
corr(u_i, Xb)  = -0.1020                        Prob > F           =    0.0000

------------------------------------------------------------------------------
       sdnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -1.320247    .075736   -17.43   0.000    -1.468799   -1.171695
        lpop |   .1608985   .0127034    12.67   0.000     .1359814    .1858156
WSincomere~B |  -.2464856   .0198835   -12.40   0.000     -.285486   -.2074852
      demres |    -.94846   .0962768    -9.85   0.000    -1.137301   -.7596187
       _cons |   1.500689   .1299582    11.55   0.000     1.245783    1.755594
-------------+----------------------------------------------------------------
     sigma_u |   .4716234
     sigma_e |  .74497543
         rho |  .28611238   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(115, 1606) =     5.32           Prob > F = 0.0000

. tsset ccode year;
       panel variable:  ccode, 2 to 990
        time variable:  year, 1763 to 2000, but with gaps

. gen lagainew=L.ainew;
(16936 missing values generated)

.  gen lagsdnew=L.sdnew;
(16936 missing values generated)

. tsset,clear;

.  xtreg ainew W lagainew, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2564
Group variable (i) : regyr                      Number of groups   =       119

R-sq:  within  = 0.6570                         Obs per group: min =         1
       between = 0.9457                                        avg =      21.5
       overall = 0.7168                                        max =        46

                                                F(2,2443)          =   2339.83
corr(u_i, Xb)  = 0.2565                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       ainew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.3282749   .0508585    -6.45   0.000    -.4280052   -.2285447
    lagainew |   .7740836    .012513    61.86   0.000     .7495464    .7986207
       _cons |   .7352812   .0496579    14.81   0.000     .6379053    .8326572
-------------+----------------------------------------------------------------
     sigma_u |  .19733294
     sigma_e |  .60871912
         rho |   .0950971   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(118, 2443) =     1.22           Prob > F = 0.0574

. xtreg ainew  WoverS  lpop WSincomeresWB lagainew, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1736
Group variable (i) : regyr                      Number of groups   =       109

R-sq:  within  = 0.6188                         Obs per group: min =         1
       between = 0.9065                                        avg =      15.9
       overall = 0.7118                                        max =        39

                                                F(4,1623)          =    658.59
corr(u_i, Xb)  = 0.3024                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       ainew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -.4700292   .0656764    -7.16   0.000    -.5988486   -.3412098
        lpop |   .0694136   .0098952     7.01   0.000      .050005    .0888222
WSincomere~B |   -.085564   .0164185    -5.21   0.000    -.1177676   -.0533603
    lagainew |   .6667702   .0180345    36.97   0.000     .6313968    .7021436
       _cons |   .4952149   .1014411     4.88   0.000     .2962457    .6941842
-------------+----------------------------------------------------------------
     sigma_u |  .23884503
     sigma_e |   .6032593
         rho |   .1355135   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(108, 1623) =     1.40           Prob > F = 0.0053

. xtreg ainew W   lpop WSincomeresWB lagainew, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1736
Group variable (i) : regyr                      Number of groups   =       109

R-sq:  within  = 0.6190                         Obs per group: min =         1
       between = 0.9076                                        avg =      15.9
       overall = 0.7122                                        max =        39

                                                F(4,1623)          =    659.10
corr(u_i, Xb)  = 0.3029                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       ainew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.4692995   .0650623    -7.21   0.000    -.5969144   -.3416847
        lpop |   .0703479    .009893     7.11   0.000     .0509435    .0897524
WSincomere~B |  -.0842838   .0163463    -5.16   0.000    -.1163459   -.0522217
    lagainew |   .6663753   .0180314    36.96   0.000     .6310079    .7017426
       _cons |   .4840205    .100325     4.82   0.000     .2872403    .6808006
-------------+----------------------------------------------------------------
     sigma_u |  .23816619
     sigma_e |   .6031135
         rho |  .13490443   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(108, 1623) =     1.39           Prob > F = 0.0061

. xtreg ainew W   lpop WSincomeresWB demres lagainew, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1620
Group variable (i) : regyr                      Number of groups   =       109

R-sq:  within  = 0.6185                         Obs per group: min =         1
       between = 0.8860                                        avg =      14.9
       overall = 0.7064                                        max =        37

                                                F(5,1506)          =    488.26
corr(u_i, Xb)  = 0.2503                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       ainew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.4368032   .0676861    -6.45   0.000    -.5695722   -.3040341
        lpop |   .0721583   .0111375     6.48   0.000     .0503117    .0940049
WSincomere~B |  -.0873717   .0170888    -5.11   0.000     -.120892   -.0538514
      demres |  -.2335838   .0811953    -2.88   0.004    -.3928516    -.074316
    lagainew |   .6647951   .0188569    35.25   0.000     .6278066    .7017836
       _cons |   .4420064   .1114086     3.97   0.000     .2234739    .6605389
-------------+----------------------------------------------------------------
     sigma_u |  .24717256
     sigma_e |  .59696674
         rho |  .14634637   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(108, 1506) =     1.46           Prob > F = 0.0021

. xtreg sdnew W lagsdnew, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      2564
Group variable (i) : regyr                      Number of groups   =       119

R-sq:  within  = 0.6775                         Obs per group: min =         1
       between = 0.9284                                        avg =      21.5
       overall = 0.7249                                        max =        46

                                                F(2,2443)          =   2566.32
corr(u_i, Xb)  = 0.1886                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       sdnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.3413057   .0503467    -6.78   0.000    -.4400323   -.2425792
    lagsdnew |   .7988917   .0125743    63.53   0.000     .7742342    .8235492
       _cons |   .6670983   .0480224    13.89   0.000     .5729295    .7612671
-------------+----------------------------------------------------------------
     sigma_u |  .18439087
     sigma_e |  .59362761
         rho |  .08799313   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(118, 2443) =     1.24           Prob > F = 0.0416

. xtreg sdnew  WoverS  lpop WSincomeresWB lagsdnew, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1736
Group variable (i) : regyr                      Number of groups   =       109

R-sq:  within  = 0.6300                         Obs per group: min =         1
       between = 0.8862                                        avg =      15.9
       overall = 0.7178                                        max =        39

                                                F(4,1623)          =    690.94
corr(u_i, Xb)  = 0.2514                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       sdnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      WoverS |  -.4579181     .06121    -7.48   0.000     -.577977   -.3378591
        lpop |    .053284   .0090054     5.92   0.000     .0356206    .0709474
WSincomere~B |  -.0797261   .0152856    -5.22   0.000    -.1097077   -.0497444
    lagsdnew |   .6862265   .0177198    38.73   0.000     .6514703    .7209826
       _cons |   .5141102   .0946199     5.43   0.000     .3285201    .6997003
-------------+----------------------------------------------------------------
     sigma_u |  .22383068
     sigma_e |  .55800339
         rho |  .13860198   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(108, 1623) =     1.60           Prob > F = 0.0002

. xtreg sdnew W   lpop WSincomeresWB lagsdnew, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1736
Group variable (i) : regyr                      Number of groups   =       109

R-sq:  within  = 0.6305                         Obs per group: min =         1
       between = 0.8871                                        avg =      15.9
       overall = 0.7182                                        max =        39

                                                F(4,1623)          =    692.35
corr(u_i, Xb)  = 0.2500                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       sdnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.4620876   .0606096    -7.62   0.000    -.5809688   -.3432064
        lpop |   .0541797   .0089982     6.02   0.000     .0365303     .071829
WSincomere~B |  -.0788746     .01521    -5.19   0.000    -.1087079   -.0490412
    lagsdnew |   .6852626   .0177086    38.70   0.000     .6505285    .7199967
       _cons |   .5073978   .0935255     5.43   0.000     .3239545    .6908412
-------------+----------------------------------------------------------------
     sigma_u |  .22315093
     sigma_e |  .55764503
         rho |   .1380301   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(108, 1623) =     1.59           Prob > F = 0.0002

. xtreg sdnew W   lpop WSincomeresWB demres lagsdnew, fe i(regyr);

Fixed-effects (within) regression               Number of obs      =      1620
Group variable (i) : regyr                      Number of groups   =       109

R-sq:  within  = 0.6341                         Obs per group: min =         1
       between = 0.8641                                        avg =      14.9
       overall = 0.7169                                        max =        37

                                                F(5,1506)          =    522.00
corr(u_i, Xb)  = 0.1908                         Prob > F           =    0.0000

------------------------------------------------------------------------------
       sdnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           W |  -.4713861   .0626811    -7.52   0.000    -.5943376   -.3484346
        lpop |   .0568031   .0100858     5.63   0.000     .0370195    .0765868
WSincomere~B |  -.0878064   .0157915    -5.56   0.000    -.1187821   -.0568308
      demres |  -.2611245   .0754678    -3.46   0.001    -.4091578   -.1130913
    lagsdnew |   .6704731   .0186782    35.90   0.000     .6338352    .7071111
       _cons |   .5128018   .1030214     4.98   0.000     .3107212    .7148824
-------------+----------------------------------------------------------------
     sigma_u |  .23329875
     sigma_e |  .54785036
         rho |  .15350584   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(108, 1506) =     1.74           Prob > F = 0.0000

. 
end of do-file

. log close
       log:  C:\bdm2s2\data\May2002\output\Bdm2S2_ch7_inst_change.log
  log type:  text
 closed on:   9 Aug 2002, 09:32:37
------------------------------------------------------------------------------------------
